{"props":{"pageProps":{"profile":{"name":"ABB Ltd","symbol":"ABB","website":"https://www.global.abb/group/en","industry":"Electrical Equipment \u0026 Parts","ipoDate":"2001-08-29","exchangeShort":"NYSE","description":"ABB Ltd engages in manufacture and sale of electrification, automation, robotics, and motion products for customers in utilities, industry and transport, and infrastructure in Switzerland and internationally. Its Electrification segment provides electric vehicle charging infrastructure, renewable power solutions, modular substation packages, distribution automation products, switchboard and panelboards, switchgear, UPS solutions, circuit breakers, measuring and sensing devices, control products, wiring accessories, enclosures and cabling systems, and intelligent home and building solutions. The company's Robotics \u0026 Discrete Automation segment offers industrial robots, software, robotic solutions and systems, field services, spare parts, and digital services. This segment also offers solutions based on its programmable logic controllers, industrial PCs, servo motion, transport system, and machine vision. Its Motion segment manufactures and sells drives, motors, generators, traction converters, and mechanical power transmission products that are driving the low-carbon future for industries, cities, infrastructure, and transportation. The company's Process Automation segment provides process and discrete control technologies, advanced process control software and manufacturing execution systems, sensing, measurement and analytical instrumentation, marine propulsion systems, and large turbochargers. In addition, this segment offers remote monitoring, preventive maintenance, asset performance management, emission monitoring, and cybersecurity services. It serves aluminum, automotive, buildings and infrastructure, cement, channel partners, chemical, data centers, food and beverage, process automation, life sciences, marine and ports, metals, mining, oil and gas, ports, power generation, printing, pulp and paper, railway, smart cities, water, and wind power industries. The company was founded in 1883 and is headquartered in Zurich, Switzerland.","search":["a","ab","abb","abb ","abb l","abb lt","abb ltd"],"sector":"Industrials","isStatic":true,"currency":"USD"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"ABB"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}