{"props":{"pageProps":{"profile":{"name":"Aluminum Corporation of China Limited","search":["a","ac","ach","al","alu","alum","alumi","alumin","aluminu","aluminum","aluminum ","aluminum c","aluminum co","aluminum cor","aluminum corp","aluminum corpo","aluminum corpor","aluminum corpora","aluminum corporat","aluminum corporati","aluminum corporatio","aluminum corporation","aluminum corporation ","aluminum corporation o","aluminum corporation of","aluminum corporation of ","aluminum corporation of c","aluminum corporation of ch","aluminum corporation of chi","aluminum corporation of chin","aluminum corporation of china","aluminum corporation of china ","aluminum corporation of china l","aluminum corporation of china li","aluminum corporation of china lim","aluminum corporation of china limi","aluminum corporation of china limit","aluminum corporation of china limite","aluminum corporation of china limited"],"currency":"USD","website":"https://www.chalco.com.cn","ipoDate":"2001-12-11","description":"Aluminum Corporation of China Limited, together with its subsidiaries, manufactures and sells alumina, primary aluminum, aluminum alloys, and carbon products in the People's Republic of China and internationally. The company operates through five segments: Alumina, Primary Aluminum, Trading, Energy, and Corporate and Other Operating. The Alumina segment mines for and purchases bauxite and other raw materials; refines bauxite into alumina; and produces and sells alumina, as well as refined alumina, gallium, and multi-form alumina bauxite. The Primary Aluminum segment procures alumina and other raw materials, supplemental materials, and electrical power; and produces and sells aluminum and aluminum-related products, such as carbon, aluminum alloy, and other electrolytic aluminum products. The Trading segment trades in alumina, primary aluminum, aluminum fabrication products, other non-ferrous metal products, coal products, and raw and supplemental materials; and provides logistics and transport services to external customers. The Energy segment mines for coal deposits; generates and sells electricity using thermal, wind, and solar power sources to regional power grid corporations; and manufactures power related equipment. The Corporate and Other Operating segment provides research and development services; and operates other aluminum-related business activities. The company also acquires, manufactures, and distributes bauxite mines and limestone ore; and provides engineering project management, as well as engages in import and export activities. Aluminum Corporation of China Limited was incorporated in 2001 and is headquartered in Beijing, the People's Republic of China.","symbol":"ACH","isStatic":true,"industry":"Aluminum","exchangeShort":"NYSE","sector":"Basic Materials"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"ACH"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}