{"props":{"pageProps":{"profile":{"industry":"Insurance—Property \u0026 Casualty","symbol":"AFG","name":"American Financial Group, Inc.","exchangeShort":"NYSE","currency":"USD","description":"American Financial Group, Inc., an insurance holding company, provides specialty property and casualty insurance products in the United States. It offers property and transportation insurance products, such as physical damage and liability coverage for buses and trucks, inland and ocean marine, agricultural-related products, and other commercial property and specialty transportation coverages; specialty casualty insurance, including primarily excess and surplus, executive and professional liability, general liability, umbrella and excess liability, and specialty coverage in targeted markets, as well as customized programs for small to mid-sized businesses and workers' compensation insurance; and specialty financial insurance products comprising risk management insurance programs for lending and leasing institutions, fidelity and surety products, and trade credit insurance. The company sells its property and casualty insurance products through independent insurance agents and brokers. American Financial Group, Inc. was founded in 1872 and is headquartered in Cincinnati, Ohio.","isStatic":true,"sector":"Financial Services","website":"https://www.afginc.com","ipoDate":"1980-03-17","search":["a","af","afg","am","ame","amer","ameri","americ","america","american","american ","american f","american fi","american fin","american fina","american finan","american financ","american financi","american financia","american financial","american financial ","american financial g","american financial gr","american financial gro","american financial grou","american financial group","american financial group,","american financial group, ","american financial group, i","american financial group, in","american financial group, inc","american financial group, inc."]}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"AFG"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}