{"props":{"pageProps":{"profile":{"ipoDate":"1984-10-08","search":["a","ai","aig","am","ame","amer","ameri","americ","america","american","american ","american i","american in","american int","american inte","american inter","american intern","american interna","american internat","american internati","american internatio","american internation","american internationa","american international","american international ","american international g","american international gr","american international gro","american international grou","american international group","american international group,","american international group, ","american international group, i","american international group, in","american international group, inc","american international group, inc."],"symbol":"AIG","currency":"USD","name":"American International Group, Inc.","industry":"Insurance—Diversified","sector":"Financial Services","website":"https://www.aig.com","description":"American International Group, Inc. offers insurance products for commercial, institutional, and individual customers in North America and internationally. The company's General Insurance segment provides general liability, environmental, commercial automobile liability, workers' compensation, casualty, and crisis management insurance products; commercial, industrial, and energy-related property insurance; and aerospace, political risk, trade credit, portfolio solutions, crop, and marine insurance. It also provides professional liability insurance products for a range of businesses and risks, including directors and officers, mergers and acquisitions, fidelity, employment practices, fiduciary liability, cyber risk, kidnap and ransom, and errors and omissions insurance. In addition, this segment offers personal auto and property insurance, such as auto, homeowners, umbrella, yacht, fine art, and collections; voluntary and sponsor-paid personal accident; supplemental health products; extended warranty insurance products; and travel insurance products. Its Life and Retirement segment offers variable annuities, index and fixed annuities, and retail mutual funds; and financial planning and advisory services; record-keeping, plan administrative, and compliance services; and term life and universal life insurance. It also provides stable value wrap products, and structured settlement and pension risk transfer annuities; and corporate- and bank-owned life insurance and guaranteed investment contracts. This segment sells its products through independent marketing organizations, independent insurance agents, financial advisors, direct marketing, banks, and broker-dealers. The company was founded in 1919 and is headquartered in New York, New York.","exchangeShort":"NYSE","isStatic":true}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"AIG"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}