{"props":{"pageProps":{"profile":{"currency":"USD","sector":"Healthcare","search":["a","an","ant","antm","anth","anthe","anthem","anthem,","anthem, ","anthem, i","anthem, in","anthem, inc","anthem, inc."],"exchangeShort":"NYSE","isStatic":true,"industry":"Healthcare Plans","website":"https://www.antheminc.com","symbol":"ANTM","name":"Anthem, Inc.","description":"Anthem, Inc., through its subsidiaries, operates as a health benefits company in the United States. It operates through four segments: Commercial \u0026 Specialty Business, Government Business, IngenioRx, and Other. The company offers a spectrum of network-based managed care health benefit plans to large and small groups, individuals, Medicaid, and Medicare markets. Its managed care plans include preferred provider organizations; health maintenance organizations; point-of-service plans; traditional indemnity plans and other hybrid plans, including consumer-driven health plans; and hospital only and limited benefit products. The company also provides a range of managed care services to self-funded customers, including claims processing, underwriting, stop loss insurance, actuarial services, provider network access, medical management, disease management, wellness programs, and other administrative services. In addition, it offers an array of specialty and other insurance products and services, such as pharmacy benefits management, dental, vision, life and disability insurance benefits, and analytics-driven personal health care. Further, the company provides services to the federal government in connection with the Federal Employee Program; and operates as a licensee of the Blue Cross and Blue Shield Association. As of December 31, 2021, it served 45 million medical members through its affiliated health plans. The company was formerly known as WellPoint, Inc. and changed its name to Anthem, Inc. in December 2014. Anthem, Inc. was founded in 1944 and is headquartered in Indianapolis, Indiana.","ipoDate":"2001-10-30"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"ANTM"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}