{"props":{"pageProps":{"profile":{"symbol":"ASX","currency":"USD","search":["a","as","asx","ase","ase ","ase t","ase te","ase tec","ase tech","ase techn","ase techno","ase technol","ase technolo","ase technolog","ase technology","ase technology ","ase technology h","ase technology ho","ase technology hol","ase technology hold","ase technology holdi","ase technology holdin","ase technology holding","ase technology holding ","ase technology holding c","ase technology holding co","ase technology holding co.","ase technology holding co.,","ase technology holding co., ","ase technology holding co., l","ase technology holding co., lt","ase technology holding co., ltd","ase technology holding co., ltd."],"ipoDate":"2001-08-28","industry":"Semiconductors","name":"ASE Technology Holding Co., Ltd.","description":"ASE Technology Holding Co., Ltd. provides a range of semiconductors packaging and testing, and electronic manufacturing services in the United States, Taiwan, rest of Asia, Europe, and internationally. It offers packaging services, including flip chip ball grid array (BGA) and chip scale package (CSP), advanced chip scale packages, quad flat packages, low profile and thin quad flat packages, bump chip carrier and quad flat no-lead (QFN) packages, advanced QFN packages, plastic BGAs, and 3D chip packages; stacked die solutions in various packages; and copper and silver wire bonding solutions. The company also provides advanced packages, such as flip chip BGA; heat-spreader FCBGA; flip-chip CSP; hybrid FCCSP; flip chip package in package and package on package (POP); advanced single sided substrate; high-bandwidth POP; fan-out wafer-level packaging; SESUB; and 2.5D silicon interposer. In addition, it offers IC wire bonding packages; system-in-package products (SiP) and modules; and interconnect materials, as well as assembles automotive electronic products. Further, the company provides a range of semiconductor testing services, including front-end engineering testing, wafer probing, logic/mixed-signal/RF module and SiP/MEMS/discrete final testing, and other test-related services, as well as drop shipment services. Additionally, it develops, constructs, sells, leases, and manages real estate properties; produces substrates; offers information software, equipment leasing, investment advisory, and warehousing management services; processes and sells computer and communication peripherals, electronic components, telecommunications equipment, and motherboards; and imports and exports goods and technology. The company was incorporated in 1984 and is headquartered in Kaohsiung, Taiwan.","isStatic":true,"exchangeShort":"NYSE","website":"https://www.aseglobal.com","sector":"Technology"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"ASX"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}