{"props":{"pageProps":{"profile":{"sector":"Technology","exchangeShort":"NASDAQ","isStatic":true,"symbol":"AZPN","currency":"USD","website":"https://www.aspentech.com","description":"Aspen Technology, Inc., together with its subsidiaries, provides asset optimization solutions in North America, Europe, the Asia Pacific, Latin America, and the Middle East. The company operates in two segments, Subscription and Software, and Services and Other. It offers asset optimization software that optimizes asset design, operations, and maintenance in various industrial environments. The company's software suites include aspenONE Engineering, aspenONE Manufacturing and Supply Chain, and aspenONE Asset Performance that are integrated applications, which allow end users to design process manufacturing environments, monitor operational performances, respond and adapt to operational changes, predict asset reliability and equipment failure, and manage planning and scheduling activities, as well as collaborate across these functions and activities. It also provides software maintenance and support, professional, and training services. The company's customers comprise companies that are engaged in the process and other capital-intensive industries, such as energy, chemicals, engineering, and construction, as well as pharmaceuticals, food and beverage, transportation, power, metals and mining, pulp and paper, and consumer packaged goods. Aspen Technology, Inc. was founded in 1981 and is headquartered in Bedford, Massachusetts.","ipoDate":"1994-10-27","industry":"Software—Application","name":"Aspen Technology, Inc.","search":["a","az","azp","azpn","as","asp","aspe","aspen","aspen ","aspen t","aspen te","aspen tec","aspen tech","aspen techn","aspen techno","aspen technol","aspen technolo","aspen technolog","aspen technology","aspen technology,","aspen technology, ","aspen technology, i","aspen technology, in","aspen technology, inc","aspen technology, inc."]}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"AZPN"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}