{"props":{"pageProps":{"profile":{"symbol":"BABA","search":["b","ba","bab","baba","a","al","ali","alib","aliba","alibab","alibaba","alibaba ","alibaba g","alibaba gr","alibaba gro","alibaba grou","alibaba group","alibaba group ","alibaba group h","alibaba group ho","alibaba group hol","alibaba group hold","alibaba group holdi","alibaba group holdin","alibaba group holding","alibaba group holding ","alibaba group holding l","alibaba group holding li","alibaba group holding lim","alibaba group holding limi","alibaba group holding limit","alibaba group holding limite","alibaba group holding limited"],"sector":"Consumer Cyclical","ipoDate":"2014-09-19","exchangeShort":"NYSE","isStatic":true,"industry":"Internet Retail","description":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. It operates through four segments: Core Commerce, Cloud Computing, Digital Media and Entertainment, and Innovation Initiatives and Others. The company operates Taobao Marketplace, a social commerce platform; Tmall, a third-party online and mobile commerce platform for brands and retailers; Alimama, a monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; and Tmall Global and Kaola, which are import e-commerce platforms. It also operates Lingshoutong that connects FMCG manufacturers and their distributors to small retailers; Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, the company offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, it provides elastic computing, database, storage, virtualization network, large-scale computing, security, management and application, big data analytics, machine learning platform, and Internet of Things services. Additionally, the company operates Youku, an online video platform; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency app; and Tmall Genie, an AI-enabled smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","website":"https://www.alibabagroup.com","currency":"USD","name":"Alibaba Group Holding Limited"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"BABA"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}