{"props":{"pageProps":{"profile":{"isStatic":true,"ipoDate":"2008-01-10","exchangeShort":"NYSE","website":"https://www.bip.brookfield.com","industry":"Utilities—Diversified","search":["b","bi","bip","br","bro","broo","brook","brookf","brookfi","brookfie","brookfiel","brookfield","brookfield ","brookfield i","brookfield in","brookfield inf","brookfield infr","brookfield infra","brookfield infras","brookfield infrast","brookfield infrastr","brookfield infrastru","brookfield infrastruc","brookfield infrastruct","brookfield infrastructu","brookfield infrastructur","brookfield infrastructure","brookfield infrastructure ","brookfield infrastructure p","brookfield infrastructure pa","brookfield infrastructure par","brookfield infrastructure part","brookfield infrastructure partn","brookfield infrastructure partne","brookfield infrastructure partner","brookfield infrastructure partners","brookfield infrastructure partners ","brookfield infrastructure partners l","brookfield infrastructure partners l.","brookfield infrastructure partners l.p","brookfield infrastructure partners l.p."],"currency":"USD","name":"Brookfield Infrastructure Partners L.P.","description":"Brookfield Infrastructure Partners L.P. owns and operates utilities, transport, midstream, and data businesses in North and South America, Europe, and the Asia Pacific. The company's Utilities segment operates approximately 61,000 kilometers (km) of operational electricity transmission and distribution lines; 5,300 km of electricity transmission lines; 4,200 km of natural gas pipelines; 7.3 million electricity and natural gas connections; and 360,000 long-term contracted sub-metering services. This segment also offers heating and cooling solutions; gas distribution; water heaters; and heating, ventilation, and air conditioner rental, as well as other home services. Its Transport segment offers transportation, storage, and handling services for merchandise goods, commodities, and passengers through a network of approximately 22,000 km of track; 5,500 km of track network; 4,800 km of rail; 3,800 km of motorways; and 13 port terminals. The company's Midstream segment offers natural gas transmission, gathering and processing, and storage services through approximately 15,000 km of natural gas transmission pipelines; 600 billion cubic feet of natural gas storage; 17 natural gas processing plants; and 3,900 km of gas gathering pipelines, as well as one petrochemical processing complex. Its Data segment operates approximately 148,000 operational telecom towers; 8,000 multi-purpose towers and active rooftop sites; 10,000 km of fiber backbone; 1,600 cell sites and approximately 12,000 km of fiber optic cable; and 2,100 active telecom towers and 70 distributed antenna systems, as well as 50 data centers and 200 megawatts of critical load capacity. The company was founded in 2007 and is based in Hamilton, Bermuda. Brookfield Infrastructure Partners L.P. is a subsidiary of Brookfield Asset Management Inc.","sector":"Utilities","symbol":"BIP"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"BIP"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}