{"props":{"pageProps":{"profile":{"currency":"USD","name":"The Bank of New York Mellon Corporation","website":"https://www.bnymellon.com","description":"The Bank of New York Mellon Corporation provides a range of financial products and services in the United States and internationally. The company operates through Securities Services, Market and Wealth Services, Investment and Wealth Management, and Other segments. The Securities Services segment offers custody, trust and depositary, accounting, exchange-traded funds, middle-office solutions, transfer agency, services for private equity and real estate funds, foreign exchange, securities lending, liquidity/lending services, prime brokerage, and data analytics. This segment also provides trustee, paying agency, fiduciary, escrow and other financial, issuer, and support services for brokers and investors. The Market and Wealth Services segment offers clearing and custody, investment, wealth and retirement solutions, technology and enterprise data management, trading, and prime brokerage services; and clearance and collateral management services. This segment also provides integrated cash management solutions, including payments, foreign exchange, liquidity management, receivables processing and payables management, and trade finance and processing services. The Investment and Wealth Management segment offers investment management strategies and distribution of investment products, investment management, custody, wealth and estate planning, private banking, investment, and information management services. The Other segment engages in the provision of leasing, corporate treasury, derivative and other trading, corporate and bank-owned life insurance, renewable energy investment, and business exit services. It serves central banks and sovereigns, financial institutions, asset managers, insurance companies, corporations, local authorities and high net-worth individuals, and family offices. The company was founded in 1784 and is headquartered in New York, New York.","symbol":"BK","isStatic":true,"exchangeShort":"NYSE","ipoDate":"2007-07-02","industry":"Asset Management","sector":"Financial Services","search":["b","bk","t","th","the","the ","the b","the ba","the ban","the bank","the bank ","the bank o","the bank of","the bank of ","the bank of n","the bank of ne","the bank of new","the bank of new ","the bank of new y","the bank of new yo","the bank of new yor","the bank of new york","the bank of new york ","the bank of new york m","the bank of new york me","the bank of new york mel","the bank of new york mell","the bank of new york mello","the bank of new york mellon","the bank of new york mellon ","the bank of new york mellon c","the bank of new york mellon co","the bank of new york mellon cor","the bank of new york mellon corp","the bank of new york mellon corpo","the bank of new york mellon corpor","the bank of new york mellon corpora","the bank of new york mellon corporat","the bank of new york mellon corporati","the bank of new york mellon corporatio","the bank of new york mellon corporation"]}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"BK"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}