{"props":{"pageProps":{"profile":{"symbol":"BR","sector":"Technology","ipoDate":"2007-03-22","currency":"USD","exchangeShort":"NYSE","description":"Broadridge Financial Solutions, Inc. provides investor communications and technology-driven solutions for the financial services industry worldwide. The company's Investor Communication Solutions segment processes and distributes proxy materials to investors in equity securities and mutual funds, as well as facilitates related vote processing services; and offers ProxyEdge, an electronic proxy delivery and voting solution. It also distributes regulatory reports, class action, and corporate action/reorganization event information, as well as tax reporting solutions; and provides content management, composition, and omni-channel distribution of regulatory, marketing, and transactional information, as well as mutual fund trade processing services. This segment offers data and analytics solutions; solutions for public corporations and mutual funds; financial reporting document composition and management solutions; SEC disclosure and filing services; registrar, stock transfer, and record-keeping services; and omni-channel customer communications solutions, as well as operates Broadridge Communications Cloud platform that creates, delivers, and manages communications and customer engagement activities. The company's Global Technology and Operations segment offers desktop productivity tools, data aggregation, performance reporting, portfolio management, order capture and execution, trade confirmation, margin, cash management, clearance and settlement, asset servicing, reference data management, reconciliations, securities financing and collateral optimization, compliance and regulatory reporting, and portfolio accounting and custody-related services. It also provides business process outsourcing services; technology solutions, such as portfolio management, compliance, and operational workflow solutions; and capital market and wealth management solutions. The company was founded in 1962 and is headquartered in Lake Success, New York.","name":"Broadridge Financial Solutions, Inc.","search":["b","br","bro","broa","broad","broadr","broadri","broadrid","broadridg","broadridge","broadridge ","broadridge f","broadridge fi","broadridge fin","broadridge fina","broadridge finan","broadridge financ","broadridge financi","broadridge financia","broadridge financial","broadridge financial ","broadridge financial s","broadridge financial so","broadridge financial sol","broadridge financial solu","broadridge financial solut","broadridge financial soluti","broadridge financial solutio","broadridge financial solution","broadridge financial solutions","broadridge financial solutions,","broadridge financial solutions, ","broadridge financial solutions, i","broadridge financial solutions, in","broadridge financial solutions, inc","broadridge financial solutions, inc."],"website":"https://www.broadridge.com","industry":"Information Technology Services","isStatic":true}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"BR"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}