{"props":{"pageProps":{"profile":{"currency":"USD","search":["c","cf","cfg","cfg-","cfg-p","cfg-pd","ci","cit","citi","citiz","citize","citizen","citizens","citizens ","citizens f","citizens fi","citizens fin","citizens fina","citizens finan","citizens financ","citizens financi","citizens financia","citizens financial","citizens financial ","citizens financial g","citizens financial gr","citizens financial gro","citizens financial grou","citizens financial group","citizens financial group,","citizens financial group, ","citizens financial group, i","citizens financial group, in","citizens financial group, inc","citizens financial group, inc."],"name":"Citizens Financial Group, Inc.","sector":"Financial Services","symbol":"CFG-PD","description":"Citizens Financial Group, Inc. operates as the bank holding company for Citizens Bank, National Association that provides retail and commercial banking products and services to individuals, small businesses, middle-market companies, corporations, and institutions in the United States. The company operates in two segments, Consumer Banking and Commercial Banking. The Consumer Banking segment offers deposit products, mortgage and home equity lending products, credit cards, business loans, wealth management, and investment services; and auto, education, and point-of-sale finance loans, as well as digital deposit products. This segment serves its customers through telephone service centers, as well as through its online and mobile platforms. The Commercial Banking segment provides various financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, and interest rate and commodity risk management solutions, as well as syndicated loans, corporate finance, mergers and acquisitions, and debt and equity capital markets services. This segment serves government banking, not-for-profit, healthcare, technology, professionals, oil and gas, asset finance, franchise finance, asset-based lending, commercial real estate, private equity, and sponsor finance industries. It operates approximately 900 branches in 11 states in the New England, as well as Mid-Atlantic and Midwest regions; 114 retail and commercial non-branch offices in national markets; and approximately 3,000 automated teller machines. The company was formerly known as RBS Citizens Financial Group, Inc. and changed its name to Citizens Financial Group, Inc. in April 2014. Citizens Financial Group, Inc. was founded in 1828 and is headquartered in Providence, Rhode Island.","ipoDate":"2019-01-25","exchangeShort":"NYSE","website":"https://www.citizensbank.com","isStatic":true,"industry":"Banks—Regional"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"CFG-PD"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}