{"props":{"pageProps":{"profile":{"ipoDate":"2014-09-10","search":["c","ch","chs","chsc","chscm","chs ","chs i","chs in","chs inc","chs inc."],"sector":"Consumer Defensive","description":"CHS Inc., an integrated agricultural company, provides grains, foods, and energy resources to businesses and consumers in North America, South America, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through four segments: Energy, Ag, Nitrogen Production, and Foods. It is involved in the operation of petroleum refineries and pipelines; supply, marketing, and distribution of refined fuels, including gasoline, diesel fuel, and other energy products; blending, sale, and distribution of lubricants; and the supply of propane and other natural gas liquids. The company also processes and sells crude oil into refined petroleum products under the Cenex brand name to member cooperatives and other independent retailers through a network of approximately 1,500 sites; and provides transportation services. In addition, it markets grains and oilseeds; and offers seeds, crop nutrients, crop protection products, animal feed, animal health products, refined and renewable fuels, and propane, as well as refined oils, meal, soy flour, and processed sunflower products. Further, the company produces and sells nitrogen-based products, including methanol, UAN and urea, and related products; manufactures, packages, and distributes vegetable oil-based products, such as packaged oils, margarine, mayonnaise, flavored dressings, sauces, and other food products; and offers cooperatives with various loans that meet commercial agriculture needs and loans to individual producers, as well as consulting and commodity risk management services. CHS Inc. was incorporated in 1936 and is headquartered in Inver Grove Heights, Minnesota.","name":"CHS Inc.","website":"https://www.chsinc.com","exchangeShort":"NASDAQ","industry":"Farm Products","isStatic":true,"symbol":"CHSCM","currency":"USD"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"CHSCM"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}