{"props":{"pageProps":{"profile":{"exchangeShort":"NYSE","name":"Canadian Natural Resources Limited","ipoDate":"2000-07-31","industry":"Oil \u0026 Gas E\u0026P","description":"Canadian Natural Resources Limited acquires, explores for, develops, produces, markets, and sells crude oil, natural gas, and natural gas liquids (NGLs). The company offers synthetic crude oil (SCO), light and medium crude oil, bitumen (thermal oil), primary heavy crude oil, and Pelican Lake heavy crude oil. Its midstream and refining assets include two crude oil pipeline systems; and a 50% working interest in an 84-megawatt cogeneration plant at Primrose. As of December 31, 2020, the company had total proved crude oil, bitumen, and NGLs reserves were 10,528 million barrels (MMbbl); total proved plus probable crude oil, bitumen, and NGLs reserves were 13,271 MMbbl; proved SCO reserves were 6,998 MMbbl; total proved plus probable SCO reserves were 7,535 MMbbl; proved natural gas reserves were 12,168 billion cubic feet (Bcf); and total proved plus probable natural gas reserves were 20,249 Bcf. It operates primarily in Western Canada; the United Kingdom portion of the North Sea; and Offshore Africa. The company was formerly known as AEX Minerals Corporation and changed its name to Canadian Natural Resources Limited in December 1975. Canadian Natural Resources Limited was incorporated in 1973 and is headquartered in Calgary, Canada.","currency":"USD","symbol":"CNQ","website":"https://www.cnrl.com","isStatic":true,"sector":"Energy","search":["c","cn","cnq","ca","can","cana","canad","canadi","canadia","canadian","canadian ","canadian n","canadian na","canadian nat","canadian natu","canadian natur","canadian natura","canadian natural","canadian natural ","canadian natural r","canadian natural re","canadian natural res","canadian natural reso","canadian natural resou","canadian natural resour","canadian natural resourc","canadian natural resource","canadian natural resources","canadian natural resources ","canadian natural resources l","canadian natural resources li","canadian natural resources lim","canadian natural resources limi","canadian natural resources limit","canadian natural resources limite","canadian natural resources limited"]}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"CNQ"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}