{"props":{"pageProps":{"profile":{"name":"Capital One Financial Corporation","currency":"USD","ipoDate":"1994-11-16","industry":"Credit Services","sector":"Financial Services","symbol":"COF","isStatic":true,"search":["c","co","cof","ca","cap","capi","capit","capita","capital","capital ","capital o","capital on","capital one","capital one ","capital one f","capital one fi","capital one fin","capital one fina","capital one finan","capital one financ","capital one financi","capital one financia","capital one financial","capital one financial ","capital one financial c","capital one financial co","capital one financial cor","capital one financial corp","capital one financial corpo","capital one financial corpor","capital one financial corpora","capital one financial corporat","capital one financial corporati","capital one financial corporatio","capital one financial corporation"],"exchangeShort":"NYSE","description":"Capital One Financial Corporation operates as the financial services holding company for the Capital One Bank (USA), National Association; and Capital One, National Association, which provides various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and treasury management and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafés, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. Capital One Financial Corporation was founded in 1988 and is headquartered in McLean, Virginia.","website":"https://www.capitalone.com"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"COF"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}