{"props":{"pageProps":{"profile":{"search":["c","cr","crl","ch","cha","char","charl","charle","charles","charles ","charles r","charles ri","charles riv","charles rive","charles river","charles river ","charles river l","charles river la","charles river lab","charles river labo","charles river labor","charles river labora","charles river laborat","charles river laborato","charles river laborator","charles river laboratori","charles river laboratorie","charles river laboratories","charles river laboratories ","charles river laboratories i","charles river laboratories in","charles river laboratories int","charles river laboratories inte","charles river laboratories inter","charles river laboratories intern","charles river laboratories interna","charles river laboratories internat","charles river laboratories internati","charles river laboratories internatio","charles river laboratories internation","charles river laboratories internationa","charles river laboratories international","charles river laboratories international,","charles river laboratories international, ","charles river laboratories international, i","charles river laboratories international, in","charles river laboratories international, inc","charles river laboratories international, inc."],"industry":"Diagnostics \u0026 Research","symbol":"CRL","exchangeShort":"NYSE","isStatic":true,"website":"https://www.criver.com","ipoDate":"2000-06-23","sector":"Healthcare","description":"Charles River Laboratories International, Inc., a non-clinical contract research organization, provides drug discovery, non-clinical development, and safety testing services in the United States, Europe, Canada, the Asia Pacific, and internationally. It operates through three segments: Research Models and Services (RMS), Discovery and Safety Assessment (DSA), and Manufacturing Solutions (Manufacturing). The RMS segment produces and sells rodent research model strains and purpose-bred rats and mice for use by researchers. This segment also provides a range of services to assist its clients in supporting the use of research models in research and screening non-clinical drug candidates, including research models, genetically engineered models and services, insourcing solutions, and research animal diagnostic services. The DSA segment offers early and in vivo discovery services for the identification and validation of novel targets, chemical compounds, and antibodies through delivery of non-clinical drug and therapeutic candidates ready for safety assessment; and safety assessment services, such as toxicology, pathology, safety pharmacology, bioanalysis, drug metabolism, and pharmacokinetics services. The Manufacturing segment provides in vitro methods for conventional and rapid quality control testing of sterile and non-sterile pharmaceuticals and consumer products. This segment also offers specialized testing of biologics that are outsourced by pharmaceutical and biotechnology companies; and avian vaccine services that provide specific-pathogen-free (SPF) fertile chicken eggs, SPF chickens, and diagnostic products used to manufacture vaccines. The company also provides contract vivarium operation services to biopharmaceutical clients. Charles River Laboratories International, Inc. was founded in 1947 and is headquartered in Wilmington, Massachusetts.","currency":"USD","name":"Charles River Laboratories International, Inc."}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"CRL"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}