{"props":{"pageProps":{"profile":{"website":"https://www.corteva.com","name":"E. I. du Pont de Nemours and Company","isStatic":true,"currency":"USD","sector":"Basic Materials","description":"E. I. du Pont de Nemours and Company provides seeds and crop protection products for the agriculture industry in the United States, Canada, Europe, the Middle East, Africa, Latin America, and the Asia Pacific. It operates through Seed and Crop Protection segments. The Seed segment develops and supplies advanced germplasm and traits that produce yield for farms; offers corn, soybean, and other oil seeds; trait technologies that enhance resistance to weather, disease, insects, and herbicides, which is used to control weeds. It also enhances food and nutritional characteristics; and digital solutions that assist farmer decision-making with a view to optimizing product selection and yield. The Crop Protection segment serves the agricultural input industry with products that protect against weeds, insects and other pests, and diseases, as well as enhance overall crop health above and below ground via nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers and pasture, and range management herbicides. In addition, it offers its products under the Pioneer, Brevant, Dairyland Seed, Hoegemeyer, Nutech, Seed Consultants, AgVenture, Alforex, PhytoGen, Pannar, VP Maxx, HPT, G2, Supreme EX, XL, Power Plus, ENLIST E3, ENLIST, EXZACT, HERCULEX, Leptra, POWERCORE, Optimum, AcreMax, REFUGE ADVANCED, SMARTSTAX, NEXERA, Omega-9 Oils, AQUAmax, Plenish, ExpressSun, Protector, Pioneer MAXIMUS, Qrome, Clearfield, PROPOUND, Conkesta, Conkesta E3, WideStrike, LumiGEN, LUMIDERM, LUMIVIA, LUMIALZA, GRANULAR, ACREVALUE, Granular, and Insights brand names. The company was founded in 1802 and is headquartered in Wilmington, Delaware. E. I. du Pont de Nemours and Company is a subsidiary of Corteva, Inc.","search":["c","ct","cta","cta-","cta-p","cta-pb","e","e.","e. ","e. i","e. i.","e. i. ","e. i. d","e. i. du","e. i. du ","e. i. du p","e. i. du po","e. i. du pon","e. i. du pont","e. i. du pont ","e. i. du pont d","e. i. du pont de","e. i. du pont de ","e. i. du pont de n","e. i. du pont de ne","e. i. du pont de nem","e. i. du pont de nemo","e. i. du pont de nemou","e. i. du pont de nemour","e. i. du pont de nemours","e. i. du pont de nemours ","e. i. du pont de nemours a","e. i. du pont de nemours an","e. i. du pont de nemours and","e. i. du pont de nemours and ","e. i. du pont de nemours and c","e. i. du pont de nemours and co","e. i. du pont de nemours and com","e. i. du pont de nemours and comp","e. i. du pont de nemours and compa","e. i. du pont de nemours and compan","e. i. du pont de nemours and company"],"symbol":"CTA-PB","industry":"Agricultural Inputs","exchangeShort":"NYSE","ipoDate":"1973-02-21"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"CTA-PB"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}