{"props":{"pageProps":{"profile":{"website":"https://www.dominionenergy.com","industry":"Utilities—Regulated Electric","description":"Dominion Energy, Inc. produces and distributes energy. The company operates through four segments: Dominion Energy Virginia, Gas Distribution, Dominion Energy South Carolina, and Contracted Assets. The Dominion Energy Virginia segment generates, transmits, and distributes regulated electricity to residential, commercial, industrial, and governmental customers in Virginia and North Carolina. The Gas Distribution segment engages in the regulated natural gas gathering, storage, transportation, distribution, and sales activities, as well as distributes nonregulated renewable natural gas. This segment serves residential, commercial, and industrial customers. The Dominion Energy South Carolina segment generates, transmits, and distributes electricity and natural gas to residential, commercial, and industrial customers in South Carolina. The Contracted Assets segment is involved in the energy marketing and price risk activities. As of December 31, 2021, the company's portfolio of assets included approximately 30.2 gigawatt of electric generating capacity; 10,700 miles of electric transmission lines; 78,000 miles of electric distribution lines; and 95,700 miles of gas distribution mains and related service facilities. It serves approximately 7 million customers. The company sells electricity at wholesale prices to rural electric cooperatives and municipalities, as well as into wholesale electricity markets. The company was formerly known as Dominion Resources, Inc. and changed its name to Dominion Energy, Inc. in May 2017. Dominion Energy, Inc. was incorporated in 1983 and is headquartered in Richmond, Virginia.","search":["d","do","dom","domi","domin","domini","dominio","dominion","dominion ","dominion e","dominion en","dominion ene","dominion ener","dominion energ","dominion energy","dominion energy,","dominion energy, ","dominion energy, i","dominion energy, in","dominion energy, inc","dominion energy, inc."],"sector":"Utilities","currency":"USD","ipoDate":"1983-05-20","isStatic":true,"name":"Dominion Energy, Inc.","symbol":"D","exchangeShort":"NYSE"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"D"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}