{"props":{"pageProps":{"profile":{"symbol":"DB","industry":"Banks—Regional","search":["d","db","de","deu","deut","deuts","deutsc","deutsch","deutsche","deutsche ","deutsche b","deutsche ba","deutsche ban","deutsche bank","deutsche bank ","deutsche bank a","deutsche bank ak","deutsche bank akt","deutsche bank akti","deutsche bank aktie","deutsche bank aktien","deutsche bank aktieng","deutsche bank aktienge","deutsche bank aktienges","deutsche bank aktiengese","deutsche bank aktiengesel","deutsche bank aktiengesell","deutsche bank aktiengesells","deutsche bank aktiengesellsc","deutsche bank aktiengesellsch","deutsche bank aktiengesellscha","deutsche bank aktiengesellschaf","deutsche bank aktiengesellschaft"],"sector":"Financial Services","name":"Deutsche Bank Aktiengesellschaft","ipoDate":"1870-05-30","exchangeShort":"NYSE","currency":"USD","description":"Deutsche Bank Aktiengesellschaft provides investment, financial, and related products and services to private individuals, corporate entities, and institutional clients worldwide. Its Corporate Bank segment provides cash management, trade finance and lending, trust and agency, foreign exchange, and securities services, as well as risk management solutions. The company's Investment Bank segment offers merger and acquisitions, and equity advisory services. This segment also focuses on financing, advisory, fixed income, risk management, sales and trading, and currencies. Its Private Bank segment provides payment and account services, and credit and deposit products, as well as investment advice, such as environmental, social, and governance products. This segment also provides wealth management, postal and parcel services, and digital offerings. The company's Asset Management segment provides investment solutions, such as alternative investments, which include real estate, infrastructure, private equity, liquid real assets, and sustainable investments; passive investments; and various services, including insurance and pension solutions, asset liability management, portfolio management solutions, asset allocation advisory, structuring, and overlay to institutions, governments, corporations and foundations, and individual investors. As of December 31, 2021, it operated 1,709 branches in 58 countries. The company was founded in 1870 and is headquartered in Frankfurt am Main, Germany.","website":"https://www.db.com","isStatic":true}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"DB"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}