{"props":{"pageProps":{"profile":{"industry":"Drug Manufacturers—Specialty \u0026 Generic","ipoDate":"2018-09-20","symbol":"ELAN","isStatic":true,"exchangeShort":"NYSE","search":["e","el","ela","elan","elanc","elanco","elanco ","elanco a","elanco an","elanco ani","elanco anim","elanco anima","elanco animal","elanco animal ","elanco animal h","elanco animal he","elanco animal hea","elanco animal heal","elanco animal healt","elanco animal health","elanco animal health ","elanco animal health i","elanco animal health in","elanco animal health inc","elanco animal health inco","elanco animal health incor","elanco animal health incorp","elanco animal health incorpo","elanco animal health incorpor","elanco animal health incorpora","elanco animal health incorporat","elanco animal health incorporate","elanco animal health incorporated"],"sector":"Healthcare","website":"https://www.elanco.com","description":"Elanco Animal Health Incorporated, an animal health company, innovates, develops, manufactures, and markets products for pets and farm animals. It offers pet health disease prevention products, such as parasiticide and vaccine products that protect pets from worms, fleas, and ticks under the Seresto, Advantage, Advantix, and Advocate brands; pet health therapeutics for pain, osteoarthritis, ear infections, cardiovascular, and dermatology indications in canines and felines under the Galliprant and Claro brands; vaccines, antibiotics, parasiticides, and other products for use in poultry and aquaculture production, as well as nutritional health products, including enzymes, probiotics, and prebiotics; and a range of vaccines, antibiotics, implants, parasiticides, and other products used in ruminant and swine production under the Rumensin and Baytril brands. The company sells its products to third-party distributors; veterinarians; and farm animal producers, including beef and dairy farmers, as well as pork, poultry, and aquaculture operations. Elanco Animal Health Incorporated was founded in 1954 and is headquartered in Greenfield, Indiana.","currency":"USD","name":"Elanco Animal Health Incorporated"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"ELAN"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}