{"props":{"pageProps":{"profile":{"industry":"Communication Equipment","symbol":"ERIC","ipoDate":"2001-08-30","website":"https://www.ericsson.com","exchangeShort":"NASDAQ","description":"Telefonaktiebolaget LM Ericsson (publ), together with its subsidiaries, provides communication infrastructure, services, and software solutions to the telecom and other sectors. It operates through four segments: Networks, Digital Services, Managed Services, and Emerging Business and Other. The Networks segment offers radio access network solutions for various network spectrum bands, including integrated high-performing hardware and software. This segment also provides integrated antenna and transport solutions; and a range of service portfolio covering network deployment and support. The Digital Services segment offers software-based solutions for business support systems, operational support systems, communication services, core networks, and cloud infrastructure. The Managed Services segment provides networks and IT managed, network design and optimization, and application development and maintenance services to telecom operators. The Emerging Business and Other segment includes emerging businesses comprising Internet of Things; iconectiv; Cradlepoint that offers wireless edge WAN 4G and 5G enterprise solutions; and Red Bee Media, MediaKind, and other new businesses. It operates in North America, Europe and Latin America, the Middle East and Africa, South East Asia, Oceania, India, North East Asia, and internationally. Telefonaktiebolaget LM Ericsson (publ) was founded in 1876 and is headquartered in Stockholm, Sweden.","sector":"Technology","name":"Telefonaktiebolaget LM Ericsson (publ)","currency":"USD","isStatic":true,"search":["e","er","eri","eric","t","te","tel","tele","telef","telefo","telefon","telefona","telefonak","telefonakt","telefonakti","telefonaktie","telefonaktieb","telefonaktiebo","telefonaktiebol","telefonaktiebola","telefonaktiebolag","telefonaktiebolage","telefonaktiebolaget","telefonaktiebolaget ","telefonaktiebolaget l","telefonaktiebolaget lm","telefonaktiebolaget lm ","telefonaktiebolaget lm e","telefonaktiebolaget lm er","telefonaktiebolaget lm eri","telefonaktiebolaget lm eric","telefonaktiebolaget lm erics","telefonaktiebolaget lm ericss","telefonaktiebolaget lm ericsso","telefonaktiebolaget lm ericsson","telefonaktiebolaget lm ericsson ","telefonaktiebolaget lm ericsson (","telefonaktiebolaget lm ericsson (p","telefonaktiebolaget lm ericsson (pu","telefonaktiebolaget lm ericsson (pub","telefonaktiebolaget lm ericsson (publ","telefonaktiebolaget lm ericsson (publ)"]}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"ERIC"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}