{"props":{"pageProps":{"profile":{"isStatic":true,"currency":"USD","industry":"Medical Devices","sector":"Healthcare","description":"Edwards Lifesciences Corporation provides products and technologies for structural heart disease, and critical care and surgical monitoring in the United States, Europe, Japan, and internationally. It offers transcatheter heart valve replacement products for the minimally invasive replacement of heart valves; and transcatheter heart valve repair and replacement products to treat mitral and tricuspid valve diseases. The company also provides the PASCAL and Cardioband transcatheter valve repair systems for minimally-invasive therapy. In addition, it offers surgical structural heart solutions, such as aortic surgical valve under the INSPIRIS name; KONECT RESILIA, a pre-assembled aortic tissue valved conduit for patients who require replacement of the valve, root, and ascending aorta; and HARPOON Beating Heart Mitral Valve Repair System for patients with degenerative mitral regurgitation. Further, the company provides critical care solutions, including advanced hemodynamic monitoring systems to measure a patient's heart function and fluid status in surgical and intensive care settings; and Acumen Hypotension Prediction Index software that alerts clinicians in advance of a patient developing dangerously low blood pressure. The company distributes its products through a direct sales force and independent distributors. Edwards Lifesciences Corporation was founded in 1958 and is headquartered in Irvine, California.","search":["e","ew","ed","edw","edwa","edwar","edward","edwards","edwards ","edwards l","edwards li","edwards lif","edwards life","edwards lifes","edwards lifesc","edwards lifesci","edwards lifescie","edwards lifescien","edwards lifescienc","edwards lifescience","edwards lifesciences","edwards lifesciences ","edwards lifesciences c","edwards lifesciences co","edwards lifesciences cor","edwards lifesciences corp","edwards lifesciences corpo","edwards lifesciences corpor","edwards lifesciences corpora","edwards lifesciences corporat","edwards lifesciences corporati","edwards lifesciences corporatio","edwards lifesciences corporation"],"ipoDate":"2000-03-27","symbol":"EW","website":"https://www.edwards.com","exchangeShort":"NYSE","name":"Edwards Lifesciences Corporation"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"EW"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}