{"props":{"pageProps":{"profile":{"name":"Ford Motor Company","ipoDate":"1956-03-07","website":"https://www.ford.com","isStatic":true,"exchangeShort":"NYSE","sector":"Consumer Cyclical","search":["f","fo","for","ford","ford ","ford m","ford mo","ford mot","ford moto","ford motor","ford motor ","ford motor c","ford motor co","ford motor com","ford motor comp","ford motor compa","ford motor compan","ford motor company"],"currency":"USD","industry":"Auto Manufacturers","description":"Ford Motor Company designs, manufactures, markets, and services a range of Ford trucks, cars, sport utility vehicles, electrified vehicles, and Lincoln luxury vehicles worldwide. It operates through three segments: Automotive, Mobility, and Ford Credit. The Automotive segment sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. The Mobility segment designs and builds mobility services; and provides self-driving systems development services. The Ford Credit segment primarily engages in vehicle-related financing and leasing activities to and through automotive dealers. It provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. This segment also offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company has a strategic collaboration with ARB Corporation Limited to develop a suite of aftermarket products for the new Ford Bronco. Ford Motor Company was incorporated in 1903 and is based in Dearborn, Michigan.","symbol":"F"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"F"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}