{"props":{"pageProps":{"profile":{"description":"First Citizens BancShares, Inc. operates as the holding company for First-Citizens Bank \u0026 Trust Company that provides retail and commercial banking services to individuals, businesses, and professionals. The company's deposit products include checking, savings, money market, and time deposit accounts. Its loan product portfolio comprises commercial construction and land development, commercial mortgage, commercial and industrial, and lease financing loans, as well as small business administration paycheck protection program loans; and consumer loans, such as residential and revolving mortgage, construction and land development, consumer auto, and other consumer loans. The company also offers treasury services products, cardholder and merchant services, wealth management services, and various other products and services; investment products, including annuities, discount brokerage services, and third-party mutual funds, as well as investment management and advisory services; and defined benefit and defined contribution, insurance, private banking, trust, fiduciary, philanthropy, and special asset services. The company provides its products and services through its branch network, as well as through digital banking, telephone banking, and various ATM networks. As of December 31, 2021, it operated 529 branches in Arizona, California, Colorado, Florida, Georgia, Kansas, Maryland, Missouri, North Carolina, New Mexico, Oklahoma, Oregon, South Carolina, Tennessee, Texas, Virginia, Washington, Wisconsin, and West Virginia. First Citizens BancShares, Inc. was founded in 1898 and is headquartered in Raleigh, North Carolina.","currency":"USD","search":["f","fc","fcn","fcnc","fcnca","fi","fir","firs","first","first ","first c","first ci","first cit","first citi","first citiz","first citize","first citizen","first citizens","first citizens ","first citizens b","first citizens ba","first citizens ban","first citizens banc","first citizens bancs","first citizens bancsh","first citizens bancsha","first citizens bancshar","first citizens bancshare","first citizens bancshares","first citizens bancshares,","first citizens bancshares, ","first citizens bancshares, i","first citizens bancshares, in","first citizens bancshares, inc","first citizens bancshares, inc."],"sector":"Financial Services","industry":"Banks—Regional","name":"First Citizens BancShares, Inc.","website":"https://www.firstcitizens.com","symbol":"FCNCA","ipoDate":"1986-10-22","exchangeShort":"NASDAQ","isStatic":true}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"FCNCA"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}