{"props":{"pageProps":{"profile":{"search":["f","ft","ftv","fo","for","fort","forti","fortiv","fortive","fortive ","fortive c","fortive co","fortive cor","fortive corp","fortive corpo","fortive corpor","fortive corpora","fortive corporat","fortive corporati","fortive corporatio","fortive corporation"],"symbol":"FTV","sector":"Technology","exchangeShort":"NYSE","name":"Fortive Corporation","industry":"Scientific \u0026 Technical Instruments","description":"Fortive Corporation designs, develops, manufactures, markets, and services professional and engineered products, software, and services worldwide. Its Intelligent Operating Solutions segment offers connected reliability tools; environment, health, safety, and quality enterprise software products; facility and asset lifecycle software; pre-construction planning and construction procurement solutions; ruggedized professional test tools; electric, pressure, and temperature calibration tools; and portable gas detection tools for a range of vertical end markets including manufacturing, process industries, healthcare, utilities and power, communications and electronics, and others. It markets its products and services under the ACCRUENT, FLUKE, GORDIAN, INDUSTRIAL SCIENTIFIC, INTELEX, PRUFTECHNIK, and SERVICECHANNEL brands. The company's Precision Technologies segment provides electrical test and measurement instruments and services; energetic material devices; and sensor and control system solutions for power and energy, medical equipment, food and beverage, aerospace and defense, off-highway vehicles, electronics, semiconductors, and other general industrial markets. This segment markets its products under the ANDERSON-NEGELE, GEMS, SETRA, HENGSTLER-DYNAPAR, QUALITROL, PACIFIC SCIENTIFIC, KEITHLEY, and TEKTRONIX brands. Its Advanced Healthcare Solutions segment offers hardware and software products and services, including instrument and device reprocessing, instrument tracking, biomedical test tools, radiation safety monitoring, and asset management services; subscription-based surgical inventory management systems to facilitate inventory management and regulatory compliance, as well as technical, analytical, and compliance services to determine radiation exposure services under the ASP, CENSIS, CENSITRAC, EVOTECH, FLUKE BIOMEDICAL, INVETECH, LANDAUER, RAYSAFE, and STERRAD brands. Fortive Corporation was incorporated in 2015 and is headquartered in Everett, Washington.","website":"https://www.fortive.com","isStatic":true,"ipoDate":"2016-06-13","currency":"USD"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"FTV"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}