{"props":{"pageProps":{"profile":{"description":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts and accessories in North America, the Asia Pacific, the Middle East, Africa, South America, the United States, and China. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Holden, Baojun, and Wuling brand names. The company also sells trucks, crossovers, cars, and purpose-built vehicles to dealers for consumer retail sales, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. In addition, it offers safety and security services for retail and fleet customers, including automatic crash response, emergency services, roadside assistance, crisis assist, stolen vehicle assistance, and turn-by-turn navigation; and connected services comprising mobile applications for owners to remotely control their vehicles and electric vehicle owners to locate charging stations, on-demand vehicle diagnostics, smart driver, marketplace in-vehicle commerce, in-vehicle voice, voice assistant, navigation and app ecosystem, connected navigation, SiriusXM with 360L, and 4G LTE wireless connectivity, as well as develops and commercializes autonomous vehicle technology. Further, the company provides automotive financing and insurance services; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","isStatic":true,"website":"https://www.gm.com","exchangeShort":"NYSE","name":"General Motors Company","symbol":"GM","currency":"USD","industry":"Auto Manufacturers","ipoDate":"2010-11-18","search":["g","gm","ge","gen","gene","gener","genera","general","general ","general m","general mo","general mot","general moto","general motor","general motors","general motors ","general motors c","general motors co","general motors com","general motors comp","general motors compa","general motors compan","general motors company"],"sector":"Consumer Cyclical"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"GM"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}