{"props":{"pageProps":{"profile":{"ipoDate":"1985-09-19","name":"Honeywell International Inc.","industry":"Conglomerates","symbol":"HON","sector":"Industrials","exchangeShort":"NASDAQ","search":["h","ho","hon","hone","honey","honeyw","honeywe","honeywel","honeywell","honeywell ","honeywell i","honeywell in","honeywell int","honeywell inte","honeywell inter","honeywell intern","honeywell interna","honeywell internat","honeywell internati","honeywell internatio","honeywell internation","honeywell internationa","honeywell international","honeywell international ","honeywell international i","honeywell international in","honeywell international inc","honeywell international inc."],"isStatic":true,"currency":"USD","website":"https://www.honeywell.com","description":"Honeywell International Inc. operates as a diversified technology and manufacturing company worldwide. Its Aerospace segment offers auxiliary power units, propulsion engines, integrated avionics, environmental control and electric power systems, engine controls, flight safety, communications, navigation hardware, data and software applications, radar and surveillance systems, aircraft lighting, advanced systems and instruments, satellite and space components, and aircraft wheels and brakes; spare parts; repair, overhaul, and maintenance services; thermal systems, as well as wireless connectivity and management services. The company's Honeywell Building Technologies segment offers software applications for building control and optimization; sensors, switches, control systems, and instruments for energy management; access control; video surveillance; fire products; and installation, maintenance, and upgrades of systems. Its Performance Materials and Technologies segment offers automation control, instrumentation, and software and related services; catalysts and adsorbents, equipment, and consulting; and materials to manufacture end products, such as bullet-resistant armor, nylon, computer chips, and pharmaceutical packaging, as well as provides reduced and low global-warming-potential materials based on hydrofluoro-olefin technology. The company's Safety and Productivity Solutions segment provides personal protection equipment, apparel, gear, and footwear; gas detection technology; cloud-based notification and emergency messaging; mobile devices and software; supply chain and warehouse automation equipment, and software solutions; custom-engineered sensors, switches, and controls; and data and asset management productivity software solutions. The company was founded in 1906 and is headquartered in Charlotte, North Carolina."}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"HON"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}