{"props":{"pageProps":{"profile":{"isStatic":true,"industry":"Medical Instruments \u0026 Supplies","name":"Hill-Rom Holdings, Inc.","currency":"USD","symbol":"HRC","website":"https://www.hillrom.com","exchangeShort":"NYSE","ipoDate":"1981-05-22","search":["h","hr","hrc","hi","hil","hill","hill-","hill-r","hill-ro","hill-rom","hill-rom ","hill-rom h","hill-rom ho","hill-rom hol","hill-rom hold","hill-rom holdi","hill-rom holdin","hill-rom holding","hill-rom holdings","hill-rom holdings,","hill-rom holdings, ","hill-rom holdings, i","hill-rom holdings, in","hill-rom holdings, inc","hill-rom holdings, inc."],"description":"Hill-Rom Holdings, Inc. operates as a medical technology company worldwide. It operates in Patient Support Systems, Front Line Care, and Surgical Solutions segments. The company offers medical surgical beds, intensive care unit beds, and bariatric patient beds, lifts and other devices, non-invasive therapeutic products and surfaces, and information technologies and software solutions, as well as sells equipment service contracts for its capital equipment. It also provides patient monitoring and diagnostics products, such as patient exam and diagnostics, patient monitoring, diagnostic cardiology, vision screening, and diagnostics products; and respiratory health products comprising Vest System, VitalCough System, MetaNeb System, Monarch, and Life2000 systems to assist patients in the mobilization of retained blockages. In addition, the company offers surgical solutions that include surgical tables, lights, and pendants; positioning devices for use in shoulder, hip, spinal, and lithotomy surgeries, as well as platform-neutral positioning accessories for operating room tables. Further, it is involved in the sales and rental of products to acute and extended care facilities through direct sales force and distributors; sales and rental of products directly to patients in the home; and sales to primary care facilities through distributors. Additionally, the company offers continuum of clinical care, including acute care and primary care, as well as clinical research organizations. Hill-Rom Holdings, Inc. was founded in 1969 and is headquartered in Chicago, Illinois.","sector":"Healthcare"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"HRC"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}