{"props":{"pageProps":{"profile":{"isStatic":true,"website":"https://www.ibm.com","sector":"Technology","industry":"Information Technology Services","name":"International Business Machines Corporation","search":["i","ib","ibm","in","int","inte","inter","intern","interna","internat","internati","internatio","internation","internationa","international","international ","international b","international bu","international bus","international busi","international busin","international busine","international busines","international business","international business ","international business m","international business ma","international business mac","international business mach","international business machi","international business machin","international business machine","international business machines","international business machines ","international business machines c","international business machines co","international business machines cor","international business machines corp","international business machines corpo","international business machines corpor","international business machines corpora","international business machines corporat","international business machines corporati","international business machines corporatio","international business machines corporation"],"ipoDate":"1915-11-11","exchangeShort":"NYSE","currency":"USD","symbol":"IBM","description":"International Business Machines Corporation provides integrated solutions and services worldwide. The company operates through four business segments: Software, Consulting, Infrastructure, and Financing. The Software segment offers hybrid cloud platform and software solutions, such as Red Hat, an enterprise open-source solutions; software for business automation, AIOps and management, integration, and application servers; data and artificial intelligence solutions; and security software and services for threat, data, and identity. This segment also provides transaction processing software that supports clients' mission-critical and on-premise workloads in banking, airlines, and retail industries. The Consulting segment offers business transformation services, including strategy, business process design and operations, data and analytics, and system integration services; technology consulting services; and application and cloud platform services. The Infrastructure segment provides on-premises and cloud-based server and storage solutions for its clients' mission-critical and regulated workloads; and support services and solutions for hybrid cloud infrastructure, as well as remanufacturing and remarketing services for used equipment. The Financing segment offers lease, installment payment, loan financing, and short-term working capital financing services. The company was formerly known as Computing-Tabulating-Recording Co. International Business Machines Corporation was incorporated in 1911 and is headquartered in Armonk, New York."}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"IBM"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}