{"props":{"pageProps":{"profile":{"ipoDate":"1964-03-02","isStatic":true,"search":["i","if","iff","in","int","inte","inter","intern","interna","internat","internati","internatio","internation","internationa","international","international ","international f","international fl","international fla","international flav","international flavo","international flavor","international flavors","international flavors ","international flavors \u0026","international flavors \u0026 ","international flavors \u0026 f","international flavors \u0026 fr","international flavors \u0026 fra","international flavors \u0026 frag","international flavors \u0026 fragr","international flavors \u0026 fragra","international flavors \u0026 fragran","international flavors \u0026 fragranc","international flavors \u0026 fragrance","international flavors \u0026 fragrances","international flavors \u0026 fragrances ","international flavors \u0026 fragrances i","international flavors \u0026 fragrances in","international flavors \u0026 fragrances inc","international flavors \u0026 fragrances inc."],"exchangeShort":"NYSE","sector":"Basic Materials","website":"https://www.iff.com","currency":"USD","description":"International Flavors \u0026 Fragrances Inc., together with its subsidiaries, manufactures and sells cosmetic active and natural health ingredients for use in various consumer products in Europe, Africa, the Middle East, Greater Asia, North America, and Latin America. It operates through Nourish, Scent, Health \u0026 Biosciences, and Pharma Solutions segments. The Nourish segment offers natural and plant-based specialty food ingredients, such as flavor compounds, and savory solutions and inclusions. It also provides natural food protection ingredients consist of natural antioxidants and anti-microbials as well as beverages, sweets , and dairy products. The Scent segment provides fragrance compounds, which include fine fragrances comprising perfumes and colognes, as well as consumer fragrances; fragrance ingredients comprising synthetic and natural ingredients that could be combined with other materials to create fragrance and consumer compounds; and cosmetic active ingredients consisting of active and functional ingredients, botanicals, and delivery systems to support its customers' cosmetic and personal care product lines. The Health \u0026 Biosciences segment develops and produces enzymes, food cultures, probiotics, and specialty ingredients. The Pharma Solutions segment produces and sells cellulosics and seaweed-based pharma excipients. The company sells its products primarily to manufacturers of perfumes and cosmetics, hair and other personal care products, soaps and detergents, cleaning products, dairy, meat and other processed foods, beverages, snacks and savory foods, sweet and baked goods, dietary supplements, infant and elderly nutrition, functional food, and pharmaceutical excipients and oral care products. International Flavors \u0026 Fragrances Inc. was founded in 1833 and is headquartered in New York, New York.","industry":"Specialty Chemicals","symbol":"IFF","name":"International Flavors \u0026 Fragrances Inc."}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"IFF"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}