{"props":{"pageProps":{"profile":{"ipoDate":"2014-06-19","symbol":"INFO","search":["i","in","inf","info","ih","ihs","ihs ","ihs m","ihs ma","ihs mar","ihs mark","ihs marki","ihs markit","ihs markit ","ihs markit l","ihs markit lt","ihs markit ltd","ihs markit ltd."],"website":"https://www.ihsmarkit.com","currency":"USD","exchangeShort":"NYSE","sector":"Industrials","name":"IHS Markit Ltd.","description":"IHS Markit Ltd. provides critical information, analytics, and solutions for various industries and markets worldwide. It operates through four segments: Financial Services, Transportation, Resources, and Consolidated Markets \u0026 Solutions. The Financial Services segment offers pricing and reference data, indices, valuation and trading services, trade processing, enterprise software, and managed services to traders, portfolio managers, risk managers, research professionals, and other financial market participants, as well as operations, compliance, and enterprise data managers. The Transportation segment provides authoritative analysis; sales and production forecasts for light vehicles, medium and heavy commercial vehicles, powertrains, components, and technology systems; performance measurement and marketing tools for carmakers, dealers, and agencies; predictive analytics and marketing automation software; and critical information for used car dealers and their customers in the used car buying process, as well as comprehensive data on ships, and monthly import and export statistics. The Resources segment offers upstream services include technical information, analytical tools, and market forecasting and consulting for the upstream industry; and downstream information, such as market forecasting, midstream market analysis and supply chain data, refining and marketing economics, and oil product pricing information for the chemical, refined products, agriculture, and power industries. The Consolidated Markets \u0026 Solutions segment provides discovery technologies, research tools, and software-based engineering decision engines; and economic and risk data and analytics, forecasts, and scenario tools. IHS Markit Ltd. was founded in 1959 and is headquartered in London, the United Kingdom. As of February 28, 2022, IHS Markit Ltd. operates as a subsidiary of S\u0026P Global Inc.","isStatic":true,"industry":"Consulting Services"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"INFO"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}