{"props":{"pageProps":{"profile":{"ipoDate":"2013-05-09","currency":"USD","isStatic":true,"exchangeShort":"NYSE","name":"IQVIA Holdings Inc.","sector":"Healthcare","website":"https://www.iqvia.com","description":"IQVIA Holdings Inc. provides advanced analytics, technology solutions, and clinical research services to the life sciences industry in the Americas, Europe, Africa, and the Asia-Pacific. It operates through three segments: Technology \u0026 Analytics Solutions, Research \u0026 Development Solutions, and Contract Sales \u0026 Medical Solutions. The Technology \u0026 Analytics Solutions segment offers a range of cloud-based applications and related implementation services; real world solutions that enable life sciences and provider customers to generate and disseminate evidence, which informs health care decision making and improves patients' outcomes; and strategic and implementation consulting services, such as advanced analytics and commercial processes outsourcing services. This segment also provides country level performance metrics related to sales of pharmaceutical products, prescribing trends, medical treatment, and promotional activity across various channels, including retail, hospital, and mail order; and measurement of sales or prescribing activity at the regional, zip code, and individual prescriber level. The Research \u0026 Development Solutions segment offers project management and clinical monitoring; clinical trial support; virtual trials; and strategic planning and design services, as well as central laboratory, genomic, bioanalytical, ADME, discovery, and vaccine and biomarker laboratory services. The Contract Sales \u0026 Medical Solutions segment provides health care provider and patient engagement services, and scientific strategy and medical affairs services. It serves pharmaceutical, biotechnology, device and diagnostic, and consumer health companies. The company has a strategic collaboration with HealthCore, Inc. The company was formerly known as Quintiles IMS Holdings, Inc. and changed its name to IQVIA Holdings Inc. in November 2017. IQVIA Holdings Inc. was founded in 1982 and is headquartered in Durham, North Carolina.","symbol":"IQV","industry":"Diagnostics \u0026 Research","search":["i","iq","iqv","iqvi","iqvia","iqvia ","iqvia h","iqvia ho","iqvia hol","iqvia hold","iqvia holdi","iqvia holdin","iqvia holding","iqvia holdings","iqvia holdings ","iqvia holdings i","iqvia holdings in","iqvia holdings inc","iqvia holdings inc."]}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"IQV"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}