{"props":{"pageProps":{"profile":{"industry":"Integrated Freight \u0026 Logistics","currency":"USD","name":"J.B. Hunt Transport Services, Inc.","sector":"Industrials","symbol":"JBHT","exchangeShort":"NASDAQ","description":"J.B. Hunt Transport Services, Inc. provides surface transportation, delivery, and logistic services in North America. It operates through five segments: Intermodal (JBI), Dedicated Contract Services (DCS), Integrated Capacity Solutions (ICS), Final Mile Services (FMS), and Truckload (JBT). The JBI segment offers intermodal freight solutions. It operates 104,973 pieces of company-owned trailing equipment; owns and maintains its chassis fleet of 85,649 units; and manages a fleet of 5,612 company-owned tractors, 582 independent contractor trucks, and 6,943 company drivers. The DCS segment designs, develops, and executes supply chain solutions that support various transportation networks. As of December 31, 2021, it operated 11,139 company-owned trucks, 544 customer-owned trucks, and 6 contractor trucks. The company also operates 21,069 owned pieces of trailing equipment and 7,753 customer-owned trailers. The ICS segment provides freight brokerage and transportation logistics solutions; flatbed, refrigerated, expedited, and less-than-truckload, as well as dry-van and intermodal solutions; an online multimodal marketplace; and logistics management for customers to outsource the transportation functions. The FMS segment offers delivery services through 1,272 company-owned trucks, 272 customer-owned trucks, and 19 independent contractor trucks; and 1,036 owned pieces of trailing equipment and 185 customer-owned trailers. The JBT segment provides dry-van freight services by utilizing tractors and trailers operating over roads and highways through 734 company-owned tractors and 11,172 company-owned trailers. It also transports or arranges for the transportation of freight, such as general merchandise, specialty consumer items, appliances, forest and paper products, food and beverages, building materials, soaps and cosmetics, automotive parts, agricultural products, electronics, and chemicals. The company was incorporated in 1961 and is headquartered in Lowell, Arkansas.","website":"https://www.jbhunt.com","ipoDate":"1983-01-01","search":["j","jb","jbh","jbht","j.","j.b","j.b.","j.b. ","j.b. h","j.b. hu","j.b. hun","j.b. hunt","j.b. hunt ","j.b. hunt t","j.b. hunt tr","j.b. hunt tra","j.b. hunt tran","j.b. hunt trans","j.b. hunt transp","j.b. hunt transpo","j.b. hunt transpor","j.b. hunt transport","j.b. hunt transport ","j.b. hunt transport s","j.b. hunt transport se","j.b. hunt transport ser","j.b. hunt transport serv","j.b. hunt transport servi","j.b. hunt transport servic","j.b. hunt transport service","j.b. hunt transport services","j.b. hunt transport services,","j.b. hunt transport services, ","j.b. hunt transport services, i","j.b. hunt transport services, in","j.b. hunt transport services, inc","j.b. hunt transport services, inc."],"isStatic":true}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"JBHT"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}