{"props":{"pageProps":{"profile":{"description":"Johnson Controls International plc, together with its subsidiaries, engages in engineering, manufacturing, commissioning, and retrofitting building products and systems in the United States, Europe, the Asia Pacific, and internationally. It operates in four segments: Building Solutions North America, Building Solutions EMEA/LA, Building Solutions Asia Pacific, and Global Products. The company designs, sells, installs, and services heating, ventilating, air conditioning, controls, building management, refrigeration, integrated electronic security, integrated fire detection and suppression systems, and fire protection and security products for commercial, industrial, retail, small business, institutional, and governmental customers; and provides energy efficiency solutions and technical services, including inspection, scheduled maintenance, and repair and replacement of mechanical and control systems, as well as data-driven smart building solutions to non-residential building and industrial applications. It also offers controls software and software services for residential and commercial applications. Johnson Controls International plc was founded in 1885 and is headquartered in Cork, Ireland.","isStatic":true,"website":"https://www.johnsoncontrols.com","name":"Johnson Controls International plc","sector":"Industrials","ipoDate":"1991-08-22","exchangeShort":"NYSE","industry":"Engineering \u0026 Construction","symbol":"JCI","currency":"USD","search":["j","jc","jci","jo","joh","john","johns","johnso","johnson","johnson ","johnson c","johnson co","johnson con","johnson cont","johnson contr","johnson contro","johnson control","johnson controls","johnson controls ","johnson controls i","johnson controls in","johnson controls int","johnson controls inte","johnson controls inter","johnson controls intern","johnson controls interna","johnson controls internat","johnson controls internati","johnson controls internatio","johnson controls internation","johnson controls internationa","johnson controls international","johnson controls international ","johnson controls international p","johnson controls international pl","johnson controls international plc"]}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"JCI"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}