{"props":{"pageProps":{"profile":{"exchangeShort":"NYSE","isStatic":true,"industry":"Drug Manufacturers—General","description":"Johnson \u0026 Johnson researches and develops, manufactures, and sells various products in the healthcare field worldwide. It operates in three segments: Consumer Health, Pharmaceutical, and Medical Devices. The Consumer Health segment offers baby care products under the JOHNSON'S and AVEENO Baby brands; oral care products under the LISTERINE brand; skin health/beauty products under the AVEENO, CLEAN \u0026 CLEAR, DR. CI:LABO, NEUTROGENA, and OGX brands; acetaminophen products under the TYLENOL brand; cold, flu, and allergy products under the SUDAFED brand; allergy products under the BENADRYL and ZYRTEC brands; ibuprofen products under the MOTRIN IB brand; smoking cessation products under the NICORETTE brand; and acid reflux products under the PEPCID brand. This segment also provides women's health products, such as sanitary pads and tampons under the STAYFREE, CAREFREE, and o.b. brands; wound care products comprising adhesive bandages under the BAND-AID brand; and first aid products under the NEOSPORIN brand. The Pharmaceutical segment offers products in various therapeutic areas, including immunology, infectious diseases, neuroscience, oncology, pulmonary hypertension, and cardiovascular and metabolic diseases. The Medical Devices segment provides electrophysiology products to treat cardiovascular diseases; neurovascular care products to treat hemorrhagic and ischemic stroke; orthopaedics products in support of hips, knees, trauma, spine, sports, and other; advanced and general surgery solutions that focus on breast aesthetics, ear, nose, and throat procedures; and disposable contact lenses and ophthalmic products related to cataract and laser refractive surgery under the ACUVUE brand. The company markets its products to general public, and retail outlets and distributors, as well as distributes directly to wholesalers, hospitals, and healthcare professionals for prescription use. Johnson \u0026 Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","search":["j","jn","jnj","jo","joh","john","johns","johnso","johnson","johnson ","johnson \u0026","johnson \u0026 ","johnson \u0026 j","johnson \u0026 jo","johnson \u0026 joh","johnson \u0026 john","johnson \u0026 johns","johnson \u0026 johnso","johnson \u0026 johnson"],"currency":"USD","sector":"Healthcare","symbol":"JNJ","ipoDate":"1944-09-25","website":"https://www.jnj.com","name":"Johnson \u0026 Johnson"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"JNJ"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}