{"props":{"pageProps":{"profile":{"website":"https://www.kla.com","isStatic":true,"symbol":"KLAC","description":"KLA Corporation designs, manufactures, and markets process control and yield management solutions for the semiconductor and related nanoelectronics industries worldwide. The company offers chip and wafer manufacturing products, including defect inspection and review systems, metrology solutions, in situ process monitoring products, computational lithography software, and data analytics systems for chip manufacturers to manage yield throughout the semiconductor fabrication process. It also provides reticle manufacturing products, such as reticle inspection, metrology, and data analytics systems for mask shops; and packaging manufacturing products comprising wafer inspection and metrology, die sorting and inspection, IC component inspection and metrology, data analytics, wafer processing systems, and IC substrate production processes. In addition, the company offers compound semiconductor, power device, light emitting diode, and microelectromechanical system manufacturing products; data storage media/head manufacturing products; general purpose/lab applications; and previous-generation KLA systems. Further, it provides wafer processing solutions; printed circuit boards, and display and inspection components; and other services. The company was formerly known as KLA-Tencor Corporation and changed its name to KLA Corporation in July 2019. KLA Corporation was incorporated in 1975 and is headquartered in Milpitas, California.","exchangeShort":"NASDAQ","sector":"Technology","name":"KLA Corporation","industry":"Semiconductor Equipment \u0026 Materials","ipoDate":"1980-10-08","currency":"USD","search":["k","kl","kla","klac","kla ","kla c","kla co","kla cor","kla corp","kla corpo","kla corpor","kla corpora","kla corporat","kla corporati","kla corporatio","kla corporation"]}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"KLAC"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}