{"props":{"pageProps":{"profile":{"sector":"Financial Services","exchangeShort":"NYSE","currency":"USD","ipoDate":"1959-03-13","website":"https://www.loews.com","industry":"Insurance—Property \u0026 Casualty","search":["l","lo","loe","loew","loews","loews ","loews c","loews co","loews cor","loews corp","loews corpo","loews corpor","loews corpora","loews corporat","loews corporati","loews corporatio","loews corporation"],"isStatic":true,"name":"Loews Corporation","symbol":"L","description":"Loews Corporation provides commercial property and casualty insurance in the United States and internationally. The company offers specialty insurance products, such as management and professional liability, and other coverage products; surety and fidelity bonds; property insurance products that include property, marine and boiler, and machinery coverages; and casualty insurance products, such as workers' compensation, general and product liability, and commercial auto and umbrella coverages. It also provides loss-sensitive insurance programs; and warranty, risk management, information, and claims administration services. The company markets its insurance products and services through independent agents, brokers, and managing general underwriters. In addition, the company is involved in the transportation and storage of natural gas and natural gas liquids(NGLs), and hydrocarbons through natural gas pipelines covering approximately 13,615 miles of interconnected pipelines; 450 miles of NGL pipelines in Louisiana and Texas; 14 underground storage fields with an aggregate gas capacity of approximately 213 billion cubic feet of natural gas; and eleven salt dome caverns and related brine infrastructure for providing brine supply services. Further, the company operates a chain of 26 hotels; and develops, manufactures, and markets a range of extrusion blow-molded and injection molded plastic containers for customers in the pharmaceutical, dairy, household chemicals, food/nutraceuticals, industrial/specialty chemicals, and water and beverage/juice segments, as well as manufactures commodity and differentiated plastic resins from recycled plastic materials. Loews Corporation was incorporated in 1969 and is headquartered in New York, New York."}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"L"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}