{"props":{"pageProps":{"profile":{"search":["l","lb","b","ba","bat","bath","bath ","bath \u0026","bath \u0026 ","bath \u0026 b","bath \u0026 bo","bath \u0026 bod","bath \u0026 body","bath \u0026 body ","bath \u0026 body w","bath \u0026 body wo","bath \u0026 body wor","bath \u0026 body work","bath \u0026 body works","bath \u0026 body works,","bath \u0026 body works, ","bath \u0026 body works, i","bath \u0026 body works, in","bath \u0026 body works, inc","bath \u0026 body works, inc."],"industry":"Apparel Retail","exchangeShort":"NYSE","isStatic":true,"website":"http://www.lb.com","symbol":"LB","currency":"USD","name":"Bath \u0026 Body Works, Inc.","description":"L Brands, Inc. operates as a specialty retailer of women's intimate and other apparel, personal care, and beauty and home fragrance products. The company operates in three segments: Victoria's Secret, Bath \u0026 Body Works, and Victoria's Secret and Bath \u0026 Body Works International. Its products include bras and panties, loungewear, athletic attire, shower gels and lotions, aromatherapy, soaps and sanitizers, and body care accessories. The company offers its products under the Victoria's Secret, PINK, Bath \u0026 Body Works, White Barn, C.O. Bigelow, and other brand names. It sells its merchandise through company-owned specialty retail stores; through its Websites; and through franchises, licenses, and wholesale partners. As of May 20, 2020, the company operated 2,897 company-owned specialty stores in the United States, Canada, the United Kingdom, and Greater China, as well as sold its brands through approximately 700 franchised locations and online worldwide. The company was formerly known as Limited Brands, Inc. and changed its name to L Brands, Inc. in March 2013. L Brands, Inc. was founded in 1963 and is headquartered in Columbus, Ohio.","sector":"Consumer Cyclical","ipoDate":"1982-06-10"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"LB"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}