{"props":{"pageProps":{"profile":{"exchangeShort":"NYSE","search":["l","lh","la","lab","labo","labor","labora","laborat","laborato","laborator","laboratory","laboratory ","laboratory c","laboratory co","laboratory cor","laboratory corp","laboratory corpo","laboratory corpor","laboratory corpora","laboratory corporat","laboratory corporati","laboratory corporatio","laboratory corporation","laboratory corporation ","laboratory corporation o","laboratory corporation of","laboratory corporation of ","laboratory corporation of a","laboratory corporation of am","laboratory corporation of ame","laboratory corporation of amer","laboratory corporation of ameri","laboratory corporation of americ","laboratory corporation of america","laboratory corporation of america ","laboratory corporation of america h","laboratory corporation of america ho","laboratory corporation of america hol","laboratory corporation of america hold","laboratory corporation of america holdi","laboratory corporation of america holdin","laboratory corporation of america holding","laboratory corporation of america holdings"],"description":"Laboratory Corporation of America Holdings operates as an independent clinical laboratory company worldwide. It operates in two segments, Labcorp Diagnostics (Dx) and Labcorp Drug Development (DD). It offers various tests, such as blood chemistry analyses, urinalyses, blood cell counts, thyroid tests, Pap tests, hemoglobin A1C and vitamin D products, prostate-specific antigens, tests for sexually transmitted diseases, hepatitis C tests, microbiology cultures and procedures, and alcohol and other substance-abuse tests. The company also provides specialty testing services comprising gene-based and esoteric testing; advanced tests target specific diseases, including anatomic pathology/oncology, cardiovascular disease, coagulation, diagnostic genetics, endocrinology, infectious disease, women's health, pharmacogenetics, and parentage and donor testing; and occupational testing services, medical drug monitoring services, chronic disease programs, and kidney stone prevention tests. It provides online and mobile applications to enable patients to check test results; and online applications for managed care organizations. It offers end-to-end drug development, medical device, and diagnostic development solutions from early-stage research to clinical development and commercial market access. It serves managed care organizations, biopharmaceutical companies, physicians and other healthcare providers, hospitals and health systems, governmental agencies, employers, patients and consumers, contract research organizations, crop protection and chemical companies, academic institutions, and independent clinical laboratories. The company was founded in 1971 and is headquartered in Burlington, North Carolina.","name":"Laboratory Corporation of America Holdings","sector":"Healthcare","symbol":"LH","ipoDate":"1991-04-24","isStatic":true,"website":"https://www.labcorp.com","industry":"Diagnostics \u0026 Research","currency":"USD"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"LH"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}