{"props":{"pageProps":{"profile":{"symbol":"LOGI","website":"https://www.logitech.com","isStatic":true,"currency":"USD","ipoDate":"2012-09-24","search":["l","lo","log","logi","logit","logite","logitec","logitech","logitech ","logitech i","logitech in","logitech int","logitech inte","logitech inter","logitech intern","logitech interna","logitech internat","logitech internati","logitech internatio","logitech internation","logitech internationa","logitech international","logitech international ","logitech international s","logitech international s.","logitech international s.a","logitech international s.a."],"sector":"Technology","exchangeShort":"NASDAQ","industry":"Computer Hardware","name":"Logitech International S.A.","description":"Logitech International S.A., through its subsidiaries, designs, manufactures, and markets products that helps people connect to digital and cloud experiences worldwide. The company offers pointing devices, such as wireless mouse; corded and cordless keyboards, living room keyboards, and keyboard-and-mouse combinations; PC webcams; and keyboards for tablets and smartphones, as well as other accessories for mobile devices. It also provides keyboards, mice, headsets, and simulation products, such as steering wheels and flight sticks for gamers; video conferencing products, and controllers for video conferencing room solutions; portable wireless Bluetooth and Wi-Fi connected speakers, PC speakers, PC headsets, microphones, in-ear headphones, and wireless audio wearables; home entertainment controllers for smart home devices comprising lighting, thermostats and door locks, and home security cameras. The company sells its products through a network of distributors, retailers, and e-tailers under the Logitech, Logitech G, ASTRO Gaming, Streamlabs, Blue Microphones, Ultimate Ears, and Jaybird brands. Its channel network includes consumer electronics distributors, retailers, mass merchandisers, specialty stores, computer and telecommunications stores, value-added resellers, and online merchants. The company was founded in 1981 and is headquartered in Lausanne, Switzerland."}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"LOGI"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}