{"props":{"pageProps":{"profile":{"sector":"Financial Services","isStatic":true,"currency":"USD","industry":"Credit Services","search":["m","ma","mas","mast","maste","master","masterc","masterca","mastercar","mastercard","mastercard ","mastercard i","mastercard in","mastercard inc","mastercard inco","mastercard incor","mastercard incorp","mastercard incorpo","mastercard incorpor","mastercard incorpora","mastercard incorporat","mastercard incorporate","mastercard incorporated"],"exchangeShort":"NYSE","ipoDate":"2006-05-25","symbol":"MA","description":"Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. It facilitates the processing of payment transactions, including authorization, clearing, and settlement, as well as delivers other payment-related products and services. The company offers integrated products and value-added services for account holders, merchants, financial institutions, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; prepaid programs and management services; commercial credit and debit payment products and solutions; and payment products and solutions that allow its customers to access funds in deposit and other accounts. It also provides value-added products and services comprising cyber and intelligence solutions for parties to transact, as well as proprietary insights, drawing on principled use of consumer, and merchant data services. In addition, the company offers analytics, test and learn, consulting, managed services, loyalty, processing, and payment gateway solutions for e-commerce merchants. Further, it provides open banking and digital identity platforms services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.","name":"Mastercard Incorporated","website":"https://www.mastercard.com"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"MA"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}