{"props":{"pageProps":{"profile":{"isStatic":true,"website":"https://www.mizuho-fg.co.jp","description":"Mizuho Financial Group, Inc., together with its subsidiaries, engages in banking, trust, securities, and other businesses related to financial services in Japan, the Americas, Europe, Asia/Oceania, and internationally. It operates through five segments: Retail \u0026 Business Banking Company, Corporate \u0026 Institutional Company, Global Corporate Company, Global Markets Company, and Asset Management Company. The company provides deposit products; syndicated, housing, and card loans; business matching services; and advisory services related to overseas expansions, and mergers and acquisitions-related services. It also offers consulting services, including asset management and asset succession; payroll services; and sells lottery tickets issued by prefectures and ordinance-designated cities. In addition, it offers financial solutions, such as bonds, mergers and acquisitions advisory, risk hedging products, etc. for corporate customers to meet their needs in fund-raising, investment management, and financial strategies; solutions based on their capital management, business strategy, and financial strategy; solutions related to real estate; advisory services and solutions, such as advice on proposals on various investment products to financial institutions; and financial services that include funding support and public bonds underwriting. Further, the company offers sales and trading services to meet needs for customers; investment products for individual customers; and consulting services for institutional investors. Additionally, the company provides products and services related to trust, securitization and structured finance, pension, and stock transfers; securities services; and research, private banking, and information technology-related services. Its branch network included Mizuho Bank, Mizuho Trust and Banking, and Mizuho Securities; and ATMs in Japan. Mizuho Financial Group, Inc. was founded in 2003 and is headquartered in Tokyo, Japan.","currency":"USD","search":["m","mf","mfg","mi","miz","mizu","mizuh","mizuho","mizuho ","mizuho f","mizuho fi","mizuho fin","mizuho fina","mizuho finan","mizuho financ","mizuho financi","mizuho financia","mizuho financial","mizuho financial ","mizuho financial g","mizuho financial gr","mizuho financial gro","mizuho financial grou","mizuho financial group","mizuho financial group,","mizuho financial group, ","mizuho financial group, i","mizuho financial group, in","mizuho financial group, inc","mizuho financial group, inc."],"name":"Mizuho Financial Group, Inc.","industry":"Banks—Regional","exchangeShort":"NYSE","symbol":"MFG","sector":"Financial Services","ipoDate":"2006-11-08"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"MFG"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}