{"props":{"pageProps":{"profile":{"sector":"Real Estate","industry":"REIT—Diversified","currency":"USD","isStatic":true,"name":"MGM Growth Properties LLC","exchangeShort":"NYSE","description":"MGM Growth Properties LLC (NYSE:MGP) is one of the leading publicly traded real estate investment trusts engaged in the acquisition, ownership and leasing of large-scale destination entertainment and leisure resorts, whose diverse amenities include casino gaming, hotel, convention, dining, entertainment and retail offerings. MGP, together with its joint venture, currently owns a portfolio of properties, consisting of 12 premier destination resorts in Las Vegas and elsewhere across the United States, MGM Northfield Park in Northfield, OH, Empire Resort Casino in Yonkers, NY, as well as a retail and entertainment district, The Park in Las Vegas. As of December 31, 2019, our destination resorts, the Park, Empire Resort Casino, and MGM Northfield Park collectively comprised approximately 27,400 hotel rooms, 1.4 million casino square footage, and 2.7 million convention square footage. As a growth-oriented public real estate entity, MGP expects its relationship with MGM Resorts and other entertainment providers to attractively position MGP for the acquisition of additional properties across the entertainment, hospitality and leisure industries.","website":"https://www.mgmgrowthproperties.com","ipoDate":"2016-04-20","search":["m","mg","mgp","mgm","mgm ","mgm g","mgm gr","mgm gro","mgm grow","mgm growt","mgm growth","mgm growth ","mgm growth p","mgm growth pr","mgm growth pro","mgm growth prop","mgm growth prope","mgm growth proper","mgm growth propert","mgm growth properti","mgm growth propertie","mgm growth properties","mgm growth properties ","mgm growth properties l","mgm growth properties ll","mgm growth properties llc"],"symbol":"MGP"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"MGP"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}