{"props":{"pageProps":{"profile":{"description":"McCormick \u0026 Company, Incorporated manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavorful products to the food industry. It operates in two segments, Consumer and Flavor Solutions. The Consumer segment offers spices, herbs, and seasonings, as well as condiments and sauces, and desserts. This segment markets its products under the McCormick, French's, Frank's RedHot, Lawry's Cholula Hot Sauce, Gourmet Garden, Club House, and OLD BAY brands in the Americas; Ducros, Schwartz, Kamis, and Drogheria \u0026 Alimentari, and Vahiné brands in Europe, the Middle East, and Africa; McCormick and DaQiao brands in China; and McCormick, Aeroplane, and Gourmet Garden brands in Australia, as well as markets regional and ethnic brands, such as Zatarain's, Stubb's, Thai Kitchen, and Simply Asia. It also supplies its products under the private labels. This segment serves retailers comprising grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce retailers directly and indirectly through distributors and wholesale foodservice suppliers. The Flavor Solutions segment offers seasoning blends, spices and herbs, condiments, coating systems, and compound flavors to multinational food manufacturers and foodservice customers. It serves foodservice customers directly and indirectly through distributors. The company was founded in 1889 and is headquartered in Hunt Valley, Maryland.","ipoDate":"2003-10-07","website":"https://www.mccormickcorporation.com","exchangeShort":"NYSE","isStatic":true,"industry":"Packaged Foods","name":"McCormick \u0026 Company, Incorporated","symbol":"MKC-V","sector":"Consumer Defensive","currency":"USD","search":["m","mk","mkc","mkc-","mkc-v","mc","mcc","mcco","mccor","mccorm","mccormi","mccormic","mccormick","mccormick ","mccormick \u0026","mccormick \u0026 ","mccormick \u0026 c","mccormick \u0026 co","mccormick \u0026 com","mccormick \u0026 comp","mccormick \u0026 compa","mccormick \u0026 compan","mccormick \u0026 company","mccormick \u0026 company,","mccormick \u0026 company, ","mccormick \u0026 company, i","mccormick \u0026 company, in","mccormick \u0026 company, inc","mccormick \u0026 company, inco","mccormick \u0026 company, incor","mccormick \u0026 company, incorp","mccormick \u0026 company, incorpo","mccormick \u0026 company, incorpor","mccormick \u0026 company, incorpora","mccormick \u0026 company, incorporat","mccormick \u0026 company, incorporate","mccormick \u0026 company, incorporated"]}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"MKC-V"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}