{"props":{"pageProps":{"profile":{"name":"Magellan Midstream Partners, L.P.","industry":"Oil \u0026 Gas Midstream","website":"https://www.magellanlp.com","currency":"USD","ipoDate":"2001-02-06","isStatic":true,"search":["m","mm","mmp","ma","mag","mage","magel","magell","magella","magellan","magellan ","magellan m","magellan mi","magellan mid","magellan mids","magellan midst","magellan midstr","magellan midstre","magellan midstrea","magellan midstream","magellan midstream ","magellan midstream p","magellan midstream pa","magellan midstream par","magellan midstream part","magellan midstream partn","magellan midstream partne","magellan midstream partner","magellan midstream partners","magellan midstream partners,","magellan midstream partners, ","magellan midstream partners, l","magellan midstream partners, l.","magellan midstream partners, l.p","magellan midstream partners, l.p."],"exchangeShort":"NYSE","symbol":"MMP","description":"Magellan Midstream Partners, L.P. engages in the transportation, storage, and distribution of refined petroleum products and crude oil in the United States. It operates through Refined Products and Crude Oil segments. The company operates refined products pipeline that transports gasoline, diesel fuel, aviation fuel, kerosene, and heating oil to wholesalers, retailers, traders, railroads, airlines, and regional farm cooperatives; and to end markets, including retail gasoline stations, truck stops, farm cooperatives, railroad fueling depots, military bases, and commercial airports. Further, it provides pipeline capacity and tank storage services, as well as terminalling, ethanol and biodiesel unloading and loading, additive injection, custom blending, laboratory testing, and data services to shippers. In addition, the company owns and operates crude oil pipelines and storage facilities; and marine terminals located along coastal waterways that provide design, installation, construction, testing, operation, replacement, and management of assets to refiners, marketers, and traders. As of December 31, 2021, it had 9,800-mile refined products pipeline system with 54 terminals; approximately 2,200 miles of crude oil pipelines and storage facilities with an aggregate storage capacity of approximately 39 million barrels; and two marine terminals. The company was incorporated in 2000 and is headquartered in Tulsa, Oklahoma.","sector":"Energy"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"MMP"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}