{"props":{"pageProps":{"profile":{"description":"Marathon Petroleum Corporation, together with its subsidiaries, operates as an integrated downstream energy company primarily in the United States. It operates in two segments: Refining \u0026 Marketing, and Midstream. The Refining \u0026 Marketing segment refines crude oil and other feedstocks at its refineries in the Gulf Coast, Mid-Continent, and West Coast regions of the United States; and purchases refined products and ethanol for resale. Its refined products include transportation fuels, such as reformulated gasolines and blend-grade gasolines; heavy fuel oil; and asphalt. This segment also manufactures aromatics, propane, propylene, and sulfur. It sells refined products to wholesale marketing customers in the United States and internationally, buyers on the spot market, and independent entrepreneurs who operate primarily Marathon branded outlets, as well as through long-term fuel supply contracts to direct dealer locations primarily under the ARCO brand. The Midstream segment transports, stores, distributes, and markets crude oil and refined products through refining logistics assets, pipelines, terminals, towboats, and barges; gathers, processes, and transports natural gas; and gathers, transports, fractionates, stores, and markets natural gas liquids. It also owns and operates crude oil, natural gas, and refined product pipelines. As of December 31, 2021, the company operated 7,159 brand jobber outlets in 37 states, the District of Columbia, and Mexico through independent entrepreneurs. Petroleum Corporation was founded in 1887 and is headquartered in Findlay, Ohio.","sector":"Energy","symbol":"MPC","website":"https://www.marathonpetroleum.com","currency":"USD","exchangeShort":"NYSE","isStatic":true,"industry":"Oil \u0026 Gas Refining \u0026 Marketing","search":["m","mp","mpc","ma","mar","mara","marat","marath","maratho","marathon","marathon ","marathon p","marathon pe","marathon pet","marathon petr","marathon petro","marathon petrol","marathon petrole","marathon petroleu","marathon petroleum","marathon petroleum ","marathon petroleum c","marathon petroleum co","marathon petroleum cor","marathon petroleum corp","marathon petroleum corpo","marathon petroleum corpor","marathon petroleum corpora","marathon petroleum corporat","marathon petroleum corporati","marathon petroleum corporatio","marathon petroleum corporation"],"name":"Marathon Petroleum Corporation","ipoDate":"2011-06-23"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"MPC"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}