{"props":{"pageProps":{"profile":{"currency":"USD","description":"Mitsubishi UFJ Financial Group, Inc., a bank holding company, provides financial services in Japan, the United States, and Asia/Oceania. The company's Retail \u0026 Commercial Banking Business Group segment offers commercial banking, trust banking, and securities products and services to retail, and small and medium-sized enterprise customers. Its Japanese Corporate \u0026 Investment Banking Business Group segment provides transaction banking, investment banking, trust banking, and securities services, as well as advanced financial solutions for large corporations. The company's Global Corporate \u0026 Investment Banking Business Group segment offers corporate, investment, and transaction banking services for large corporate and financial institutions. Its Global Commercial Banking Business Group segment provides retail and commercial banking services, including loans, deposits, fund transfers, investments, and asset management services for local retail, small and medium-sized enterprise, and corporate customers. The company's Asset Management \u0026 Investor Services Business Group segment offers asset management and administration services for corporations and pension funds, such as pension fund management and administration, advice on pension structures, and payments to beneficiaries, as well as investment trusts for retail customers. Its Global Markets Business Group segment sells and trades in fixed income instruments, currencies, equities, and other investment products; originates and distributes of financial products; and provides treasury services comprising asset and liability management, as well as global investments. Mitsubishi UFJ Financial Group, Inc. was founded in 1880 and is headquartered in Tokyo, Japan.","ipoDate":"2013-05-01","isStatic":true,"sector":"Financial Services","symbol":"MUFG","search":["m","mu","muf","mufg","mi","mit","mits","mitsu","mitsub","mitsubi","mitsubis","mitsubish","mitsubishi","mitsubishi ","mitsubishi u","mitsubishi uf","mitsubishi ufj","mitsubishi ufj ","mitsubishi ufj f","mitsubishi ufj fi","mitsubishi ufj fin","mitsubishi ufj fina","mitsubishi ufj finan","mitsubishi ufj financ","mitsubishi ufj financi","mitsubishi ufj financia","mitsubishi ufj financial","mitsubishi ufj financial ","mitsubishi ufj financial g","mitsubishi ufj financial gr","mitsubishi ufj financial gro","mitsubishi ufj financial grou","mitsubishi ufj financial group","mitsubishi ufj financial group,","mitsubishi ufj financial group, ","mitsubishi ufj financial group, i","mitsubishi ufj financial group, in","mitsubishi ufj financial group, inc","mitsubishi ufj financial group, inc."],"industry":"Banks—Diversified","website":"https://www.mufg.jp","exchangeShort":"NYSE","name":"Mitsubishi UFJ Financial Group, Inc."}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"MUFG"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}