{"props":{"pageProps":{"profile":{"industry":"Software—Infrastructure","ipoDate":"1989-06-23","website":"https://www.nortonLifeLock.com","sector":"Technology","exchangeShort":"NASDAQ","isStatic":true,"symbol":"NLOK","description":"NortonLifeLock Inc. provides cyber safety solutions for consumers worldwide. The company offers Norton 360, an integrated platform provides extensive cyber safety coverage and a subscription service providing protection for PCs, Macs, and mobile devices against malware, viruses, adware, ransomware, and other online threats on various platforms; and LifeLock identity theft protection solution that offers monitoring, alerts, and restoration services to its customers. It also provides Norton Secure VPN solution enhances security and online privacy by providing an encrypted data tunnel; Privacy Monitor Assistant, an on-demand, white glove service where agents help members delete personal information from data brokers online; Home Title Protect product detects fraud and notifies members; and Avira Security, a consumer-focused portfolio of cybersecurity and privacy solutions. The company markets and sells its products and related services through retailers, telecom service providers, hardware original equipment manufacturers, and employee benefit providers, as well as e-commerce platform. It operates in the United States, Canada, Latin America, Europe, the Middle East, Africa, the Asia Pacific, and Japan. The company was formerly known as Symantec Corporation and changed its name to NortonLifeLock Inc. in November 2019. NortonLifeLock Inc. was founded in 1982 and is headquartered in Tempe, Arizona.","search":["n","nl","nlo","nlok","no","nor","nort","norto","norton","nortonl","nortonli","nortonlif","nortonlife","nortonlifel","nortonlifelo","nortonlifeloc","nortonlifelock","nortonlifelock ","nortonlifelock i","nortonlifelock in","nortonlifelock inc","nortonlifelock inc."],"currency":"USD","name":"NortonLifeLock Inc."}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"NLOK"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}