{"props":{"pageProps":{"profile":{"symbol":"NVDA","description":"NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, and internationally. The company's Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building 3D designs and virtual worlds. Its Compute \u0026 Networking segment provides Data Center platforms and systems for AI, HPC, and accelerated computing; Mellanox networking and interconnect solutions; automotive AI Cockpit, autonomous driving development agreements, and autonomous vehicle solutions; cryptocurrency mining processors; Jetson for robotics and other embedded platforms; and NVIDIA AI Enterprise and other software. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers/distributors, independent software vendors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. It has a strategic collaboration with Kroger Co. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.","website":"https://www.nvidia.com","ipoDate":"1999-01-22","name":"NVIDIA Corporation","sector":"Technology","industry":"Semiconductors","exchangeShort":"NASDAQ","search":["n","nv","nvd","nvda","nvi","nvid","nvidi","nvidia","nvidia ","nvidia c","nvidia co","nvidia cor","nvidia corp","nvidia corpo","nvidia corpor","nvidia corpora","nvidia corporat","nvidia corporati","nvidia corporatio","nvidia corporation"],"isStatic":true,"currency":"USD"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"NVDA"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}