{"props":{"pageProps":{"profile":{"description":"News Corporation, a media and information services company, focuses on creating and distributing content for consumers and businesses worldwide. It operates in six segments: Digital Real Estate Services, Subscription Video Services, Dow Jones, Book Publishing, News Media, and Other. The company distributes content and data products, including The Wall Street Journal, Factiva, Dow Jones Risk \u0026 Compliance, Dow Jones Newswires, Barron's, MarketWatch, and Investor's Business Daily through various media channels, such as newspapers, newswires, websites, applications for mobile devices, tablets and e-book readers, newsletters, magazines, proprietary databases, live journalism, videos, and podcasts. It also owns and operates daily, Sunday, weekly, and bi-weekly newspapers comprising The Australian, The Weekend Australian, The Daily Telegraph, The Sunday Telegraph, Herald Sun, Sunday Herald Sun, The Courier Mail, The Sunday Mail, The Advertiser, Sunday Mail, The Sun, The Sun on Sunday, The Times, The Sunday Times, and New York Post, as well as digital mastheads and other websites. In addition, the company publishes general fiction, nonfiction, children's, and religious books; provides video sports, entertainment, and news services to pay-TV subscribers and other commercial licensees primarily through cable, satellite, and internet distribution; and broadcasts rights to live sporting events. Further, it offers property and property-related advertising and services on its websites and mobile applications; online real estate services; and professional software and service products, as well as financial services. The company is headquartered in New York, New York.","website":"https://newscorp.com","name":"News Corporation","currency":"USD","search":["n","nw","nws","ne","new","news","news ","news c","news co","news cor","news corp","news corpo","news corpor","news corpora","news corporat","news corporati","news corporatio","news corporation"],"isStatic":true,"ipoDate":"2013-06-19","symbol":"NWS","sector":"Communication Services","industry":"Broadcasting","exchangeShort":"NASDAQ"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"NWS"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}