{"props":{"pageProps":{"profile":{"description":"Occidental Petroleum Corporation, together with its subsidiaries, engages in the acquisition, exploration, and development of oil and gas properties in the United States, the Middle East, Africa, and Latin America. It operates through three segments: Oil and Gas, Chemical, and Midstream and Marketing. The company's Oil and Gas segment explores for, develops, and produces oil and condensate, natural gas liquids (NGLs), and natural gas. Its Chemical segment manufactures and markets basic chemicals, including chlorine, caustic soda, chlorinated organics, potassium chemicals, ethylene dichloride, chlorinated isocyanurates, sodium silicates, and calcium chloride; vinyls comprising vinyl chloride monomer, polyvinyl chloride, and ethylene. The Midstream and Marketing segment gathers, processes, transports, stores, purchases, and markets oil, condensate, NGLs, natural gas, carbon dioxide, and power. This segment also trades around its assets consisting of transportation and storage capacity; and invests in entities. Occidental Petroleum Corporation was founded in 1920 and is headquartered in Houston, Texas.","name":"Occidental Petroleum Corporation","website":"https://www.oxy.com","exchangeShort":"NYSE","symbol":"OXY","sector":"Energy","ipoDate":"1964-03-03","industry":"Oil \u0026 Gas E\u0026P","currency":"USD","isStatic":true,"search":["o","ox","oxy","oc","occ","occi","occid","occide","occiden","occident","occidenta","occidental","occidental ","occidental p","occidental pe","occidental pet","occidental petr","occidental petro","occidental petrol","occidental petrole","occidental petroleu","occidental petroleum","occidental petroleum ","occidental petroleum c","occidental petroleum co","occidental petroleum cor","occidental petroleum corp","occidental petroleum corpo","occidental petroleum corpor","occidental petroleum corpora","occidental petroleum corporat","occidental petroleum corporati","occidental petroleum corporatio","occidental petroleum corporation"]}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"OXY"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}