{"props":{"pageProps":{"profile":{"symbol":"PANW","industry":"Software—Infrastructure","currency":"USD","ipoDate":"2012-07-20","search":["p","pa","pan","panw","pal","palo","palo ","palo a","palo al","palo alt","palo alto","palo alto ","palo alto n","palo alto ne","palo alto net","palo alto netw","palo alto netwo","palo alto networ","palo alto network","palo alto networks","palo alto networks,","palo alto networks, ","palo alto networks, i","palo alto networks, in","palo alto networks, inc","palo alto networks, inc."],"isStatic":true,"name":"Palo Alto Networks, Inc.","website":"https://www.paloaltonetworks.com","sector":"Technology","exchangeShort":"NASDAQ","description":"Palo Alto Networks, Inc. provides cybersecurity solutions worldwide. The company offers firewall appliances and software; Panorama, a security management solution for the control of firewall appliances and software deployed on an end-customer's network and instances in public or private cloud environments, as a virtual or a physical appliance; and virtual system upgrades, which are available as extensions to the virtual system capacity that ships with physical appliances. It also provides subscription services covering the areas of threat prevention, malware and persistent threat, uniform resource locator filtering, laptop and mobile device protection, and firewall; and DNS security, Internet of Things security, SaaS security API, and SaaS security inline, as well as threat intelligence, and data loss prevention. In addition, the company offers cloud security, secure access, security analytics and automation, and threat intelligence and cyber security consulting; professional services, including architecture design and planning, implementation, configuration, and firewall migration; education services, such as certifications, as well as online and in-classroom training; and support services. Palo Alto Networks, Inc. sells its products and services through its channel partners, as well as directly to medium to large enterprises, service providers, and government entities operating in various industries, including education, energy, financial services, government entities, healthcare, Internet and media, manufacturing, public sector, and telecommunications. The company was incorporated in 2005 and is headquartered in Santa Clara, California."}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"PANW"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}