{"props":{"pageProps":{"profile":{"exchangeShort":"NASDAQ","name":"Plug Power Inc.","ipoDate":"1999-10-28","website":"https://www.plugpower.com","industry":"Electrical Equipment \u0026 Parts","currency":"USD","isStatic":true,"symbol":"PLUG","sector":"Industrials","description":"Plug Power Inc. provides hydrogen fuel cell turnkey solutions for the mobility, material handling, and stationary power markets in North America and internationally. It focuses on proton exchange membrane (PEM) fuel cell and fuel processing technologies, and fuel cell/battery hybrid technologies, as well as related hydrogen and green hydrogen generation, storage, and dispensing infrastructure. The company offers GenDrive, a hydrogen-fueled PEM fuel cell system that provides power to material handling electric vehicles; GenFuel, a liquid hydrogen fueling delivery, generation, storage, and dispensing system; GenCare, an ongoing internet of things-based maintenance and service program for GenDrive and GenSure fuel cells, GenFuel hydrogen storage and dispensing products, and ProGen engines; and GenSure, a stationary fuel cell solution that offers modular PEM fuel cell power to support the backup and grid-support power requirements of the telecommunications, transportation, and utility sectors. It also provides GenKey, an integrated turn-key solution for transitioning to fuel cell power; ProGen, a fuel cell stack and engine technology used in mobility and stationary fuel cell systems, and as engines in electric delivery vans; and GenFuel Electrolyzer, a hydrogen generator optimized for clean hydrogen production. The company offers its products to retail distribution and manufacturing businesses through a direct product sales force, original equipment manufacturers, and dealer networks. It has a strategic partnership with Airbus SE to decarbonize air travel and airport operations with green hydrogen; and Fortescue Future Industries to manufacture electrolyzer technology in Australia. Plug Power Inc. was founded in 1997 and is headquartered in Latham, New York.","search":["p","pl","plu","plug","plug ","plug p","plug po","plug pow","plug powe","plug power","plug power ","plug power i","plug power in","plug power inc","plug power inc."]}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"PLUG"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}