{"props":{"pageProps":{"profile":{"name":"Philip Morris International Inc.","description":"Philip Morris International Inc., through its subsidiaries, manufactures and sells cigarettes, other nicotine-containing products, smoke-free products, and related electronic devices and accessories. The company offers IQOS smoke-free products, including heated tobacco and nicotine-containing vapor products under the HEETS, HEETS Creations, HEETS Dimensions, HEETS Marlboro, HEETS FROM MARLBORO, Marlboro Dimensions, Marlboro HeatSticks, and Parliament HeatSticks brands, as well as under the Fiit and Miix licensed brands. It also sells its products under the Marlboro, Parliament, Bond Street, Chesterfield, L\u0026M, Lark, and Philip Morris brands. In addition, the company owns various cigarette brands, such as Dji Sam Soe, Sampoerna A, and Sampoerna U in Indonesia; and Fortune and Jackpot in the Philippines. It markets and sells its products in the European Union, Eastern Europe, the Middle East, Africa, South and Southeast Asia, East Asia, Australia, Latin America, and Canada. Philip Morris International Inc. was incorporated in 1987 and is headquartered in New York, New York.","symbol":"PM","search":["p","pm","ph","phi","phil","phili","philip","philip ","philip m","philip mo","philip mor","philip morr","philip morri","philip morris","philip morris ","philip morris i","philip morris in","philip morris int","philip morris inte","philip morris inter","philip morris intern","philip morris interna","philip morris internat","philip morris internati","philip morris internatio","philip morris internation","philip morris internationa","philip morris international","philip morris international ","philip morris international i","philip morris international in","philip morris international inc","philip morris international inc."],"website":"https://www.pmi.com","sector":"Consumer Defensive","exchangeShort":"NYSE","isStatic":true,"industry":"Tobacco","ipoDate":"2008-03-17","currency":"USD"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"PM"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}