{"props":{"pageProps":{"profile":{"name":"The PNC Financial Services Group, Inc.","symbol":"PNC","sector":"Financial Services","ipoDate":"1987-10-21","search":["p","pn","pnc","t","th","the","the ","the p","the pn","the pnc","the pnc ","the pnc f","the pnc fi","the pnc fin","the pnc fina","the pnc finan","the pnc financ","the pnc financi","the pnc financia","the pnc financial","the pnc financial ","the pnc financial s","the pnc financial se","the pnc financial ser","the pnc financial serv","the pnc financial servi","the pnc financial servic","the pnc financial service","the pnc financial services","the pnc financial services ","the pnc financial services g","the pnc financial services gr","the pnc financial services gro","the pnc financial services grou","the pnc financial services group","the pnc financial services group,","the pnc financial services group, ","the pnc financial services group, i","the pnc financial services group, in","the pnc financial services group, inc","the pnc financial services group, inc."],"currency":"USD","exchangeShort":"NYSE","industry":"Banks—Regional","isStatic":true,"website":"https://www.pnc.com","description":"The PNC Financial Services Group, Inc. operates as a diversified financial services company in the United States. The company's Retail Banking segment offers brokerage, insurance, and investment and cash management services; checking, savings, and money market accounts; certificates of deposits; and lending products, which includes residential mortgages, home equity loans and lines of credit, auto loans, education loans, and personal and small business loans, and credit cards to consumer and small business customers through a network of branches, ATMs, call centers, and online and mobile banking channels. Its Corporate \u0026 Institutional Banking segment provides secured and unsecured loans, letters of credit, and equipment leases; cash and investment management services, receivables and disbursement management services, funds transfer services, international payment services, and access to online/mobile information management and reporting services; foreign exchange, derivatives, fixed income, securities underwriting, loan syndications, and mergers and acquisitions and equity capital markets advisory related services; and commercial loan servicing and technology solutions for the commercial real estate finance industry. The company's Asset Management Group segment offers investment and retirement planning, customized investment management, credit and cash management solutions, private banking, and trust management and administration solutions; and multi-generational family planning products, such as estate, financial, tax planning, fiduciary, and customized performance reporting services. This segment also provides outsourced chief investment officer, custody, private real estate, cash and fixed income client solutions, and fiduciary retirement advisory services. As of December 31, 2021, it operated 2,629 branches and 9,523 ATMs. The PNC Financial Services Group, Inc. was founded in 1852 and is headquartered in Pittsburgh, Pennsylvania."}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"PNC"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}