{"props":{"pageProps":{"profile":{"isStatic":true,"currency":"USD","symbol":"PTR","search":["p","pt","ptr","pe","pet","petr","petro","petroc","petroch","petrochi","petrochin","petrochina","petrochina ","petrochina c","petrochina co","petrochina com","petrochina comp","petrochina compa","petrochina compan","petrochina company","petrochina company ","petrochina company l","petrochina company li","petrochina company lim","petrochina company limi","petrochina company limit","petrochina company limite","petrochina company limited"],"exchangeShort":"NYSE","name":"PetroChina Company Limited","description":"PetroChina Company Limited, together with its subsidiaries, engages in a range of petroleum related products, services, and activities in Mainland China and internationally. It operates through Exploration and Production, Refining and Chemicals, Marketing, and Natural Gas and Pipeline segments. The Exploration and Production segment engages in the exploration, development, production, and marketing of crude oil and natural gas. The Refining and Chemicals segment refines crude oil and petroleum products; and produces and markets primary petrochemical products, derivative petrochemical products, and other chemical products. The Marketing segment is involved in marketing of refined products and trading business. The Natural Gas and Pipeline segment engages in the transmission of natural gas, crude oil, and refined products; and sale of natural gas. As of December 31, 2020, the company had a total length of 31,151 km, including 22,555 km of natural gas pipelines, 7,190 km of crude oil pipelines, and 1,406 km of refined product pipelines. The company is also involved in the exploration, development, and production of oil sands and coalbed methane; trading of crude oil and petrochemical products; storage, chemical engineering, storage facilities, service station, and transportation facilities and related businesses; and production and sales of basic and derivative chemical, and other chemical products. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China. PetroChina Company Limited is a subsidiary of China National Petroleum Corporation.","website":"https://www.petrochina.com.cn","ipoDate":"2013-02-11","industry":"Oil \u0026 Gas Integrated","sector":"Energy"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"PTR"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}