{"props":{"pageProps":{"profile":{"industry":"Specialty Chemicals","symbol":"RPM","search":["r","rp","rpm","rpm ","rpm i","rpm in","rpm int","rpm inte","rpm inter","rpm intern","rpm interna","rpm internat","rpm internati","rpm internatio","rpm internation","rpm internationa","rpm international","rpm international ","rpm international i","rpm international in","rpm international inc","rpm international inc."],"isStatic":true,"website":"https://www.rpminc.com","ipoDate":"1998-01-09","name":"RPM International Inc.","sector":"Basic Materials","exchangeShort":"NYSE","currency":"USD","description":"RPM International Inc. manufactures, markets, and sells specialty chemicals for the industrial, specialty, and consumer markets worldwide. It offers waterproofing, coatings, and institutional roofing systems; air barriers, tapes, and foams; residential home weatherization systems; roofing and building maintenance and related services; sealing and bonding, and subfloor preparation, flooring, and in-plant glazing solutions; solutions for fire stopping and intumescent steel coating, and the manufacturing industry; rolled asphalt roofing materials and chemical admixtures; concrete and masonry admixtures, concrete fibers, curing and sealing compounds, structural grouts and mortars, epoxy adhesives, injection resins, polyurethane foams, floor hardeners and toppings, joint fillers, industrial and architectural coatings, decorative color/stains/stamps, and restoration materials; and insulated building cladding materials and concrete form wall systems. It also provides polymer flooring systems; fiberglass reinforced plastic gratings and shapes; corrosion-control coating, containment and railcar lining, fire and sound proofing, and heat and cryogenic insulation products; and specialty construction products; and amine curing agents, reactive diluents, specialty epoxy resins and other intermediates. In addition, it offers fluorescent colorants and pigments; shellac-based-specialty and marine coatings; fire and water damage restoration, and carpet cleaning and disinfecting products; fuel additives; wood treatments, furniture finishes, and touch-up products; and nail enamels, polishes, and coating components. Further, it offers specialty products for paint contractors and the DIYers, concrete restoration and flooring systems, metallic and faux finish coatings, cleaners, and hobby paints and cements; and caulk, sealant, adhesive, insulating foam, spackling, glazing, and patch and repair products. The company was incorporated in 1947 and is headquartered in Medina, Ohio."}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"RPM"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}