{"props":{"pageProps":{"profile":{"currency":"USD","symbol":"RS","exchangeShort":"NYSE","industry":"Steel","description":"Reliance Steel \u0026 Aluminum Co. operates as a diversified metal solutions provider and the metals service center company in the United States, Canada, and internationally. The company distributes a line of approximately 100,000 metal products, including alloy, aluminum, brass, copper, carbon steel, stainless steel, titanium, and specialty steel products; and provides metals processing services to general manufacturing, non-residential construction, transportation, aerospace, energy, electronics and semiconductor fabrication, and heavy industries. It also distributes non-ferrous metals products and tubular building products; and manufactures specialty extruded metals, fabricated parts, and welded components. As of December 31, 2021, the company operated a network of approximately 315 locations in 40 states in the United States and 13 in other countries. It sells its products directly to original equipment manufacturers, which primarily include small machine shops and fabricators. The company was founded in 1939 and is headquartered in Los Angeles, California.","sector":"Basic Materials","ipoDate":"1994-09-16","website":"https://www.rsac.com","name":"Reliance Steel \u0026 Aluminum Co.","isStatic":true,"search":["r","rs","re","rel","reli","relia","relian","relianc","reliance","reliance ","reliance s","reliance st","reliance ste","reliance stee","reliance steel","reliance steel ","reliance steel \u0026","reliance steel \u0026 ","reliance steel \u0026 a","reliance steel \u0026 al","reliance steel \u0026 alu","reliance steel \u0026 alum","reliance steel \u0026 alumi","reliance steel \u0026 alumin","reliance steel \u0026 aluminu","reliance steel \u0026 aluminum","reliance steel \u0026 aluminum ","reliance steel \u0026 aluminum c","reliance steel \u0026 aluminum co","reliance steel \u0026 aluminum co."]}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"RS"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}