{"props":{"pageProps":{"profile":{"isStatic":true,"exchangeShort":"NYSE","ipoDate":"2013-02-11","website":"https://www.shinhangroup.com","search":["s","sh","shg","shi","shin","shinh","shinha","shinhan","shinhan ","shinhan f","shinhan fi","shinhan fin","shinhan fina","shinhan finan","shinhan financ","shinhan financi","shinhan financia","shinhan financial","shinhan financial ","shinhan financial g","shinhan financial gr","shinhan financial gro","shinhan financial grou","shinhan financial group","shinhan financial group ","shinhan financial group c","shinhan financial group co","shinhan financial group co.","shinhan financial group co.,","shinhan financial group co., ","shinhan financial group co., l","shinhan financial group co., lt","shinhan financial group co., ltd","shinhan financial group co., ltd."],"name":"Shinhan Financial Group Co., Ltd.","currency":"USD","sector":"Financial Services","industry":"Banks—Regional","description":"Shinhan Financial Group Co., Ltd. provides financial products and services in South Korea and internationally. The company operates through five segments: Banking, Credit Card, Securities, Life Insurance, and Others. It offers retail banking services, including demand, savings, and fixed deposit-taking; checking accounts; mortgage and home equity, and retail lending; electronic banking and automatic teller machines (ATM); and bill paying, payroll and check-cashing, currency exchange, and wire fund transfer services. The company also provides corporate banking services, such as investment banking, real estate financing, overseas real estate and development project financing, infrastructure and structured financing, equity/venture investments, mergers and acquisitions consulting; securitization and derivatives services comprising securities and derivative products, and foreign exchange trading; and working capital loans and facilities loans. In addition, it is involved in treasury and investment activities in international capital markets consisting of foreign currency-denominated securities trading, foreign exchange trading and services, trade-related financial services, international factoring services, and foreign banking operations. Further, the company offers trust account management, securities brokerage, and asset management services, as well as leasing and equipment financing, savings banking, loan collection and credit reporting, collective investment administration, private equity investment, and financial system development services. As of December 31, 2020, it operated a network of 859 service centers; 5,472 ATMs; 12 cash dispensers; and 37 digital kiosks. Shinhan Financial Group Co., Ltd. was founded in 1982 and is headquartered in Seoul, South Korea.","symbol":"SHG"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"SHG"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}