{"props":{"pageProps":{"profile":{"isStatic":true,"ipoDate":"1965-10-20","search":["s","sj","sjm","t","th","the","the ","the j","the j.","the j. ","the j. m","the j. m.","the j. m. ","the j. m. s","the j. m. sm","the j. m. smu","the j. m. smuc","the j. m. smuck","the j. m. smucke","the j. m. smucker","the j. m. smucker ","the j. m. smucker c","the j. m. smucker co","the j. m. smucker com","the j. m. smucker comp","the j. m. smucker compa","the j. m. smucker compan","the j. m. smucker company"],"sector":"Consumer Defensive","industry":"Packaged Foods","description":"The J. M. Smucker Company manufactures and markets branded food and beverage products worldwide. It operates in four segments: U.S. Retail Coffee, U.S. Retail Consumer Foods, U.S. Retail Pet Foods, and International and Away From Home. The company offers mainstream roast, ground, single serve, and premium coffee; peanut butter and specialty spreads; fruit spreads, shortening and oils, and frozen sandwiches; pet food and pet snacks; and foodservice hot beverage, foodservice portion control, and flour products, as well as dog and cat food, frozen handheld products, juices and beverages, and baking ingredient. It provides its products under the Folgers, Café Bustelo, Dunkin' Donuts, 1850, Jif, Smucker's, Crisco, Smucker's Uncrustables, Meow Mix, Kibbles 'n Bits, 9Lives, Nature's Recipe, Milk-Bone, Pup-Peroni, Rachael Ray Nutrish, Natural Balance, Robin Hood, and Five Roses brands. The company sells its products through direct sales and brokers to food retailers and wholesalers, club stores, pet specialty stores, discount and dollar stores, drug stores, military commissaries, mass merchandisers, natural foods stores and distributors, and online retailers; and through retail channels, and foodservice distributors and operators. The J. M. Smucker Company was founded in 1897 and is headquartered in Orrville, Ohio.","website":"https://www.jmsmucker.com","name":"The J. M. Smucker Company","currency":"USD","symbol":"SJM","exchangeShort":"NYSE"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"SJM"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}