{"props":{"pageProps":{"profile":{"name":"SK Telecom Co.,Ltd","description":"SK Telecom Co., Ltd. provides wireless telecommunication services in South Korea and internationally. The Cellular Services segment offers wireless voice and data transmission, cellular global roaming, interconnection, Internet of Things, and platform services, as well as sells smartphones, basic phones, tablets and other Internet access devices, and wearable devices. The Fixed-Line Telecommunication Services segment provides local, domestic and international long distance, and voice over Internet protocol services; broadband Internet access; Internet protocol TV and mobile over-the-top; and leased line solutions, Internet data center, and network solution services. The Commerce Services segment operates 11st, an online open marketplace; and T-commerce network that offer assortment of goods and services through pre-recorded television programming. The Other Businesses segment provides marketing platform services, such as Syrup Wallet, a mobile wallet service; OK Cashbag, a loyalty points program; and One Store, a mobile application marketplace. The Security Services segment offers physical security services, which includes centralized monitoring system; information security solutions, such as information security consulting, managed security, and cyber threat intelligence solutions; and operates parking management and security solutions business. In addition, it offers call center management, base station maintenance, information gathering and consulting, system software development and supply, quantum information and communications, data base and internet website, and digital contents sourcing services; manufactures and sells e-book; sells and trades in anti-theft and surveillance devices; and operates information and communications facilities. As of December 31, 2020, the company had 3.8 million fixed-line telephone and 31.4 million wireless subscribers. The company was incorporated in 1984 and is headquartered in Seoul, South Korea.","isStatic":true,"industry":"Telecom Services","ipoDate":"2013-02-11","symbol":"SKM","search":["s","sk","skm","sk ","sk t","sk te","sk tel","sk tele","sk telec","sk teleco","sk telecom","sk telecom ","sk telecom c","sk telecom co","sk telecom co.","sk telecom co.,","sk telecom co.,l","sk telecom co.,lt","sk telecom co.,ltd"],"currency":"USD","sector":"Communication Services","exchangeShort":"NYSE","website":"https://www.sktelecom.com"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"SKM"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}