{"props":{"pageProps":{"profile":{"description":"Sumitomo Mitsui Financial Group, Inc., together with its subsidiaries, provides commercial banking, leasing, securities, consumer finance, and other services in Japan, the Americas, Europe, the Middle East, Asia, and Oceania. It operates through four segments: Wholesale Business Unit, Retail Business Unit, Global Business Unit, and Global Markets Business Unit. The Wholesale Business Unit segment offers financing, investment management, risk hedging, and settlement services, as well as financial solutions related to mergers and acquisition, and other advisory services primarily for large, mid, and small-sized corporate clients; various leasing services, including equipment, and operating and leveraged leasing; and digital services, such as robotic process automation and electronic contract services. The Retail Business Unit segment offers wealth management, settlement, consumer finance, and housing loan products and services, as well as business and asset succession services to high-net-worth customers. The Global Business Unit segment offers loans, deposits, clearing services, trade finance, project finance, loan syndication, derivatives, and cash management services; underwriting services; and leasing services related to the construction machinery, transportation equipment, industrial machinery, medical equipment, and aircraft leasing. The Global Markets Business Unit segment offers solutions through foreign exchange products, derivatives, bonds, stocks, and other marketable financial products. It also undertakes asset liability management operations. The company also offers credit card, Internet banking, system development and engineering, data processing, management consulting and economic research, and investment advisory and investment trust management services. Sumitomo Mitsui Financial Group, Inc. was incorporated in 2002 and is headquartered in Tokyo, Japan.","industry":"Banks—Diversified","currency":"USD","sector":"Financial Services","website":"https://www.smfg.co.jp","search":["s","sm","smf","smfg","su","sum","sumi","sumit","sumito","sumitom","sumitomo","sumitomo ","sumitomo m","sumitomo mi","sumitomo mit","sumitomo mits","sumitomo mitsu","sumitomo mitsui","sumitomo mitsui ","sumitomo mitsui f","sumitomo mitsui fi","sumitomo mitsui fin","sumitomo mitsui fina","sumitomo mitsui finan","sumitomo mitsui financ","sumitomo mitsui financi","sumitomo mitsui financia","sumitomo mitsui financial","sumitomo mitsui financial ","sumitomo mitsui financial g","sumitomo mitsui financial gr","sumitomo mitsui financial gro","sumitomo mitsui financial grou","sumitomo mitsui financial group","sumitomo mitsui financial group,","sumitomo mitsui financial group, ","sumitomo mitsui financial group, i","sumitomo mitsui financial group, in","sumitomo mitsui financial group, inc","sumitomo mitsui financial group, inc."],"symbol":"SMFG","ipoDate":"2013-02-11","isStatic":true,"name":"Sumitomo Mitsui Financial Group, Inc.","exchangeShort":"NYSE"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"SMFG"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}