{"props":{"pageProps":{"profile":{"sector":"Basic Materials","exchangeShort":"NYSE","ipoDate":"2013-02-11","symbol":"SQM","industry":"Chemicals","website":"https://www.sqm.com","search":["s","sq","sqm","so","soc","soci","socie","socied","socieda","sociedad","sociedad ","sociedad q","sociedad qu","sociedad quí","sociedad quím","sociedad quími","sociedad químic","sociedad química","sociedad química ","sociedad química y","sociedad química y ","sociedad química y m","sociedad química y mi","sociedad química y min","sociedad química y mine","sociedad química y miner","sociedad química y minera","sociedad química y minera ","sociedad química y minera d","sociedad química y minera de","sociedad química y minera de ","sociedad química y minera de c","sociedad química y minera de ch","sociedad química y minera de chi","sociedad química y minera de chil","sociedad química y minera de chile","sociedad química y minera de chile ","sociedad química y minera de chile s","sociedad química y minera de chile s.","sociedad química y minera de chile s.a","sociedad química y minera de chile s.a."],"isStatic":true,"name":"Sociedad Química y Minera de Chile S.A.","description":"Sociedad Química y Minera de Chile S.A. produces and distributes specialty plant nutrients, iodine and its derivatives, lithium and its derivatives, potassium chloride and sulfate, industrial chemicals, and other products and services. The company offers specialty plant nutrients, including potassium nitrate, sodium nitrate, sodium potassium nitrate, specialty blends, and other specialty fertilizers. It also provides iodine and its derivatives for use in medical, pharmaceutical, agricultural, and industrial applications comprising x-ray contrast media, polarizing films for LCD and LED, antiseptics, biocides and disinfectants, pharmaceutical synthesis, electronics, pigments, and dye components. In addition, the company offers lithium carbonates for various applications that include electrochemical materials for batteries, frits for the ceramic and enamel industries, heat-resistant glass, air conditioning chemicals, continuous casting powder for steel extrusion, primary aluminum smelting process, pharmaceuticals, and lithium derivatives, as well as ingredient in manufacturing of gunpowder. Further, it supplies lithium hydroxide for the lubricating greases industry, as well as cathodes for batteries. Additionally, it offers potassium chloride and potassium sulfate for various crops, including corn, rice, sugar, soybean, and wheat; industrial chemicals, including sodium nitrate, potassium nitrate, potassium chloride, and solar salts; and other fertilizers and blends. The company operates in Chile, Latin America and the Caribbean, Europe, North America, Asia, and internationally. Sociedad Química y Minera de Chile S.A. was incorporated in 1968 and is headquartered in Santiago, Chile.","currency":"USD"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"SQM"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}