{"props":{"pageProps":{"profile":{"symbol":"SSNC","currency":"USD","search":["s","ss","ssn","ssnc","ss\u0026","ss\u0026c","ss\u0026c ","ss\u0026c t","ss\u0026c te","ss\u0026c tec","ss\u0026c tech","ss\u0026c techn","ss\u0026c techno","ss\u0026c technol","ss\u0026c technolo","ss\u0026c technolog","ss\u0026c technologi","ss\u0026c technologie","ss\u0026c technologies","ss\u0026c technologies ","ss\u0026c technologies h","ss\u0026c technologies ho","ss\u0026c technologies hol","ss\u0026c technologies hold","ss\u0026c technologies holdi","ss\u0026c technologies holdin","ss\u0026c technologies holding","ss\u0026c technologies holdings","ss\u0026c technologies holdings,","ss\u0026c technologies holdings, ","ss\u0026c technologies holdings, i","ss\u0026c technologies holdings, in","ss\u0026c technologies holdings, inc","ss\u0026c technologies holdings, inc."],"description":"SS\u0026C Technologies Holdings, Inc., together with its subsidiaries, provides software products and software-enabled services to financial services and healthcare industries. The company owns and operates technology stack across securities accounting; front-office functions, such as trading and modeling; middle-office functions include portfolio management and reporting; back-office functions, such as accounting, performance measurement, reconciliation, reporting, processing and clearing, and compliance and tax reporting; and healthcare solutions comprising claims adjudication, benefit management, care management, and business intelligence solutions. Its products and services allow professionals in the financial services and healthcare industries to automate complex business processes and are instrumental in helping its clients to manage information processing requirements. The company's software-enabled services include SS\u0026C GlobeOp, Global Investor and Distribution Solutions, SS\u0026C Retirement Solutions, Black Diamond Wealth Platform, Bluedoor, Advent Outsourcing Services, Advent Data Solutions, ALPS Advisors, and Virtual Data Rooms, as well as pharmacy, healthcare administration, and health outcomes optimization solutions. Its software products comprise portfolio/investment accounting and analytics software, portfolio management software, trading software, digital process automation product suite, and banking and lending solutions, as well as research, analytics, risk, and training solutions. The company also provides professional services, including consulting and implementation services to assist clients; and product support services. It operates in the United States; the United Kingdom; Europe, the Middle East, and Africa; the Asia Pacific and Japan; Canada; and the Americas. The company was founded in 1986 and is headquartered in Windsor, Connecticut.","website":"https://www.ssctech.com","isStatic":true,"ipoDate":"2010-03-31","industry":"Software—Application","sector":"Technology","name":"SS\u0026C Technologies Holdings, Inc.","exchangeShort":"NASDAQ"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"SSNC"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}