{"props":{"pageProps":{"profile":{"search":["t","td","tdy","te","tel","tele","teled","teledy","teledyn","teledyne","teledyne ","teledyne t","teledyne te","teledyne tec","teledyne tech","teledyne techn","teledyne techno","teledyne technol","teledyne technolo","teledyne technolog","teledyne technologi","teledyne technologie","teledyne technologies","teledyne technologies ","teledyne technologies i","teledyne technologies in","teledyne technologies inc","teledyne technologies inco","teledyne technologies incor","teledyne technologies incorp","teledyne technologies incorpo","teledyne technologies incorpor","teledyne technologies incorpora","teledyne technologies incorporat","teledyne technologies incorporate","teledyne technologies incorporated"],"exchangeShort":"NYSE","name":"Teledyne Technologies Incorporated","currency":"USD","sector":"Technology","description":"Teledyne Technologies Incorporated provides enabling technologies for industrial growth markets in the United States, Canada, the United Kingdom, Belgium, the Netherlands, and internationally. The company's Instrumentation segment offers monitoring and control instruments for marine, environmental, industrial, and other applications, as well as electronic test and measurement equipment; and power and communications connectivity devices for distributed instrumentation systems and sensor networks. Its Digital Imaging segment provides visible spectrum sensors and digital cameras for industrial machine vision and automated quality control, as well as for medical, research, and scientific applications; and infrared and X-ray spectra for use in industrial, government, and medical applications, as well as micro electromechanical systems and semiconductors, including analog-to-digital and digital-to-analog converters. This segment also offers thermal imaging systems, visible-light imaging systems, locater systems, measurement and diagnostic systems, and threat-detection solutions. The company's Aerospace and Defense Electronics segment provides electronic components and subsystems, as well as communications products, such as defense electronics, environment interconnects, data acquisition and communications equipment for aircraft, components and subsystems for wireless and satellite communications, and general aviation batteries. Its Engineered Systems segment offers systems engineering and integration, technology development, and manufacturing solutions for defense, space, environmental, and energy applications; and designs and manufactures electrochemical energy systems and electronics for military applications. The company markets and sells its products and services through a direct internal sales force, as well as third-party sales representatives and distributors. Teledyne Technologies Incorporated was founded in 1960 and is headquartered in Thousand Oaks, California.","industry":"Scientific \u0026 Technical Instruments","isStatic":true,"ipoDate":"1999-11-23","website":"https://www.teledyne.com","symbol":"TDY"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"TDY"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}