{"props":{"pageProps":{"profile":{"symbol":"TEAM","isStatic":true,"description":"Atlassian Corporation Plc, through its subsidiaries, designs, develops, licenses, and maintains various software products worldwide. Its products include JIRA, a workflow management system for teams to plan, track, collaborate, and manage work, and projects; Jira Service Management, a service desk product for creating and managing service experiences for various service team providers, including IT, legal, and HR teams; Jira Align for enterprise agile planning; Opsgenie, an incident management tool that centralizes alerts and notifies right people at right time; and Statuspage for incident communication. The company also provides Confluence, a remote-friendly team workspace used to build, organize, and collaborate on work virtually for team content creation and sharing; and Trello, a collaboration product, that manages projects, organizes tasks, and builds team spirit for capturing and adding structure to fluid, fast-forming work for teams. In addition, it offers Bitbucket for code sharing and management; and various other products, such as Atlassian cloud apps, Bamboo, Crowd, Crucible, Fisheye, Halp, Sourcetree, and Statuspage. Atlassian Corporation Plc was founded in 2002 and is headquartered in Sydney, Australia.","name":"Atlassian Corporation Plc","industry":"Software—Application","sector":"Technology","exchangeShort":"NASDAQ","ipoDate":"2015-12-09","website":"https://www.atlassian.com","currency":"USD","search":["t","te","tea","team","a","at","atl","atla","atlas","atlass","atlassi","atlassia","atlassian","atlassian ","atlassian c","atlassian co","atlassian cor","atlassian corp","atlassian corpo","atlassian corpor","atlassian corpora","atlassian corporat","atlassian corporati","atlassian corporatio","atlassian corporation","atlassian corporation ","atlassian corporation p","atlassian corporation pl","atlassian corporation plc"]}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"TEAM"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}