{"props":{"pageProps":{"profile":{"search":["t","te","tec","tech","b","bi","bio","bio-","bio-t","bio-te","bio-tec","bio-tech","bio-techn","bio-techne","bio-techne ","bio-techne c","bio-techne co","bio-techne cor","bio-techne corp","bio-techne corpo","bio-techne corpor","bio-techne corpora","bio-techne corporat","bio-techne corporati","bio-techne corporatio","bio-techne corporation"],"symbol":"TECH","website":"https://www.bio-techne.com","name":"Bio-Techne Corporation","isStatic":true,"industry":"Biotechnology","ipoDate":"1989-02-09","sector":"Healthcare","currency":"USD","exchangeShort":"NASDAQ","description":"Bio-Techne Corporation, together with its subsidiaries, develops, manufactures, and sells life science reagents, instruments, and services for the research, and diagnostics and bioprocessing markets worldwide. The company operates through two segments, Protein Sciences, and Diagnostics and Genomics. The Protein Sciences segment provides biological reagents used in various aspects of life science research, diagnostics, and cell and gene therapy, such as cytokines and growth factors, antibodies, small molecules, tissue culture sera, and cell selection technologies. This segment also offers proteomic analytical tools for automated western blot and multiplexed ELISA workflow consists of manual and automated protein analysis instruments and immunoassays for use in quantifying proteins in various biological fluids. The Diagnostics and Genomics segment provides diagnostic products, including controls, calibrators, and diagnostic assays for regulated diagnostics market, exosome-based molecular diagnostic assays, advanced tissue-based in-situ hybridization assays for spatial genomic and tissue biopsy analysis, and genetic and oncology kits for research and clinical applications; and nucleic acid analysis products for use in diagnostic or research applications, as well as instruments and process control products for hematology, blood chemistry, blood gases, and coagulation controls and reagents used in various diagnostic applications. It offers its products under R\u0026D Systems, Novus Biologicals, Tocris Biosciences, ProteinSimple, Advanced Cell Diagnostics, and ExosomeDx brands. Bio-Techne Corporation has a clinical research collaboration with Carterra Inc. for the study of COVID-19 variants. The company was formerly known as Techne Corporation and changed its name to Bio-Techne Corporation in November 2014. Bio-Techne Corporation was founded in 1976 and is headquartered in Minneapolis, Minnesota."}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"TECH"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}