{"props":{"pageProps":{"profile":{"ipoDate":"2013-02-11","currency":"USD","symbol":"TEVA","industry":"Drug Manufacturers—Specialty \u0026 Generic","website":"https://www.tevapharm.com","search":["t","te","tev","teva","teva ","teva p","teva ph","teva pha","teva phar","teva pharm","teva pharma","teva pharmac","teva pharmace","teva pharmaceu","teva pharmaceut","teva pharmaceuti","teva pharmaceutic","teva pharmaceutica","teva pharmaceutical","teva pharmaceutical ","teva pharmaceutical i","teva pharmaceutical in","teva pharmaceutical ind","teva pharmaceutical indu","teva pharmaceutical indus","teva pharmaceutical indust","teva pharmaceutical industr","teva pharmaceutical industri","teva pharmaceutical industrie","teva pharmaceutical industries","teva pharmaceutical industries ","teva pharmaceutical industries l","teva pharmaceutical industries li","teva pharmaceutical industries lim","teva pharmaceutical industries limi","teva pharmaceutical industries limit","teva pharmaceutical industries limite","teva pharmaceutical industries limited"],"sector":"Healthcare","name":"Teva Pharmaceutical Industries Limited","exchangeShort":"NYSE","description":"Teva Pharmaceutical Industries Limited, a pharmaceutical company, develops, manufactures, markets, and distributes generic medicines, specialty medicines, and biopharmaceutical products in North America, Europe, and internationally. The company offers sterile products, hormones, high-potency drugs, and cytotoxic substances in various dosage forms, including tablets, capsules, injectables, inhalants, liquids, transdermal patches, ointments, and creams. It also develops, manufactures, and sells active pharmaceutical ingredients. In addition, it focuses on the central nervous system, pain, respiratory, and oncology areas. Its products in the central nervous system include Copaxone for the treatment of relapsing forms of multiple sclerosis; AJOVY for the preventive treatment of migraine; and AUSTEDO for the treatment of tardive dyskinesia and chorea associated with Huntington disease. The company's products in the respiratory market comprise ProAir, QVAR, ProAir Digihaler, AirDuo Digihaler, and ArmonAir Digihaler, BRALTUS, CINQAIR/CINQAERO, DuoResp Spiromax, and AirDuo RespiClick/ArmonAir RespiClick for the treatment of asthma and chronic obstructive pulmonary disease. Its products in the oncology market include Bendeka, Treanda, Granix, Trisenox, Lonquex, and Tevagrastim/Ratiograstim. Teva Pharmaceutical Industries Limited has a collaboration MedinCell for the development and commercialization of multiple long-acting injectable products, a risperidone suspension for the treatment of patients with schizophrenia. The company was founded in 1901 and is headquartered in Tel Aviv-Yafo, Israel.","isStatic":true}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"TEVA"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}