{"props":{"pageProps":{"profile":{"website":"https://global.toyota/en","sector":"Consumer Cyclical","isStatic":true,"industry":"Auto Manufacturers","exchangeShort":"NYSE","currency":"USD","description":"Toyota Motor Corporation designs, manufactures, assembles, and sells passenger vehicles, minivans and commercial vehicles, and related parts and accessories. It operates in Automotive, Financial Services, and All Other segments. The company offers hybrid cars under the Prius, Prius PHV, C-HR, LC HV, ES HV, Camry, JPN TAXI, Avalon HV, Crown HV, Century HV, UX HV, Corolla SD, Corolla Sport, RAV4 HV, WG HV, RAV4 PHV, Highlander HV, Harrier HV, Sienna HV, UX EV, Corolla Cross HV, and Yaris HV names; fuel cell vehicles under the MIRAI and SORA names; and conventional engine vehicles, including subcompact and compact cars under the Corolla, Yaris, Corolla Sport , Aqua, Passo, Roomy, Tank, Etios, Vios, AGYA, Rush, GLANZA, Urban Cruiser, and Raize names. It also provides mini-vehicles, passenger vehicles, commercial vehicles, and auto parts under the Toyota name; mid-size cars under the Camry name; luxury cars under the Lexus, Avalon, Crown, and Century names; sports cars under the GR Yaris and Supra names; and recreational and sport-utility vehicles under the Sequoia, 4Runner, RAV4, Highlander, and Land Cruiser names. In addition, the company offers pickup trucks under the Tacoma and Tundra names; Minivans, Cabwagons, and Semi-Bonnet Wagon under the Alphard, Vellfire, Noah/Voxy, Esquire, Hiace, Sienta, and Sienna names; and trucks and buses. Further, it provides financial services, such as retail financing and leasing, wholesale financing, insurance, and credit cards; and designs, manufactures, and sells prefabricated housing. Additionally, the company operates GAZOO.com, a web portal for automobile information. It operates in Japan, North America, Europe, Asia, Central and South America, Oceania, Africa, and the Middle East. The company was founded in 1933 and is headquartered in Toyota, Japan.","ipoDate":"2013-02-11","name":"Toyota Motor Corporation","symbol":"TM","search":["t","tm","to","toy","toyo","toyot","toyota","toyota ","toyota m","toyota mo","toyota mot","toyota moto","toyota motor","toyota motor ","toyota motor c","toyota motor co","toyota motor cor","toyota motor corp","toyota motor corpo","toyota motor corpor","toyota motor corpora","toyota motor corporat","toyota motor corporati","toyota motor corporatio","toyota motor corporation"]}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"TM"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}