{"props":{"pageProps":{"profile":{"ipoDate":"1997-04-15","industry":"Electronic Gaming \u0026 Multimedia","sector":"Communication Services","name":"Take-Two Interactive Software, Inc.","currency":"USD","search":["t","tt","ttw","ttwo","ta","tak","take","take-","take-t","take-tw","take-two","take-two ","take-two i","take-two in","take-two int","take-two inte","take-two inter","take-two intera","take-two interac","take-two interact","take-two interacti","take-two interactiv","take-two interactive","take-two interactive ","take-two interactive s","take-two interactive so","take-two interactive sof","take-two interactive soft","take-two interactive softw","take-two interactive softwa","take-two interactive softwar","take-two interactive software","take-two interactive software,","take-two interactive software, ","take-two interactive software, i","take-two interactive software, in","take-two interactive software, inc","take-two interactive software, inc."],"isStatic":true,"symbol":"TTWO","website":"https://www.take2games.com","description":"Take-Two Interactive Software, Inc. develops, publishes, and markets interactive entertainment solutions for consumers worldwide. The company offers its products under the Rockstar Games, 2K, Private Division, Social Point, and Playdots labels. It develops and publishes action/adventure products under the Grand Theft Auto, Max Payne, Midnight Club, and Red Dead Redemption names; and offers episodes and content. The company also develops brands in other genres, including the LA Noire, Bully, and Manhunt franchises. In addition, the company publishes various entertainment properties across various platforms and a range of genres, such as shooter, action, role-playing, strategy, sports, and family/casual entertainment under the BioShock, Mafia, Sid Meier's Civilization, XCOM series, and Borderlands. Further, it publishes sports simulation titles comprising NBA 2K series, a basketball video game; the WWE 2K professional wrestling series; and PGA TOUR 2K. It also offers Kerbal Space Program, and The Outer Worlds and Ancestors: the Humankind Odyssey under Private Division. Additionally, the company offers free-to-play mobile games, such as Dragon City and Monster Legends, as well as Two Dots mobile game. Its products are designed for console gaming systems, including PlayStation 4; Xbox One; the Nintendo Switch; and personal computers comprising smartphones and tablets. The company provides its products through physical retail, digital download, online platforms, and cloud streaming services. Take-Two Interactive Software, Inc. was incorporated in 1993 and is based in New York, New York.","exchangeShort":"NASDAQ"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"TTWO"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}