{"props":{"pageProps":{"profile":{"currency":"USD","website":"https://www.vrtx.com","name":"Vertex Pharmaceuticals Incorporated","industry":"Biotechnology","description":"Vertex Pharmaceuticals Incorporated, a biotechnology company, engages in developing and commercializing therapies for treating cystic fibrosis. The company markets SYMDEKO/SYMKEVI, ORKAMBI, and KALYDECO to treat patients with cystic fibrosis who have specific mutations in their cystic fibrosis transmembrane conductance regulator gene; and TRIKAFTA for the treatment of patients with CF 6 years of age or older who have at least one F508del mutation. Its pipeline includes VX-864 for the treatment of AAT deficiency, which is in Phase 2 clinical trial; VX-147 for the treatment of APOL1-mediated focal segmental glomerulosclerosis, or FSGS, and other serious kidney diseases which is in Phase 2 clinical trial; VX- 880, treatment for Type 1 Diabetes which is in Phase 1/2 clinical trial; VX-548, a NaV1.8 inhibitor for treatments of acute, neuropathic, musculoskeletal pain which is in Phase 2 clinical trial; and CTX001 for the treatment severe SCD and TDT which is in Phase 3 clinical trial. The company sells its products primarily to specialty pharmacy and specialty distributors in the United States, as well as specialty distributors and retail chains, and hospitals and clinics internationally. It has collaborations with Affinia Therapeutics, Inc.; Arbor Biotechnologies, Inc.; CRISPR Therapeutics AG.; Kymera Therapeutics, Inc.; Mammoth Biosciences, Inc.; Moderna, Inc.; Obsidian Therapeutics, Inc.; and Skyhawk Therapeutics, Inc.; as well as Ribometrix, Inc.; Genomics plc; Merck KGaA; Darmstadt, Germany, and X-Chem, Inc. Vertex Pharmaceuticals Incorporated was founded in 1989 and is headquartered in Boston, Massachusetts.","symbol":"VRTX","isStatic":true,"sector":"Healthcare","search":["v","vr","vrt","vrtx","ve","ver","vert","verte","vertex","vertex ","vertex p","vertex ph","vertex pha","vertex phar","vertex pharm","vertex pharma","vertex pharmac","vertex pharmace","vertex pharmaceu","vertex pharmaceut","vertex pharmaceuti","vertex pharmaceutic","vertex pharmaceutica","vertex pharmaceutical","vertex pharmaceuticals","vertex pharmaceuticals ","vertex pharmaceuticals i","vertex pharmaceuticals in","vertex pharmaceuticals inc","vertex pharmaceuticals inco","vertex pharmaceuticals incor","vertex pharmaceuticals incorp","vertex pharmaceuticals incorpo","vertex pharmaceuticals incorpor","vertex pharmaceuticals incorpora","vertex pharmaceuticals incorporat","vertex pharmaceuticals incorporate","vertex pharmaceuticals incorporated"],"exchangeShort":"NASDAQ","ipoDate":"1991-07-24"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"VRTX"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}