{"props":{"pageProps":{"profile":{"currency":"USD","isStatic":true,"sector":"Industrials","symbol":"WAB","search":["w","wa","wab","we","wes","west","westi","westin","westing","westingh","westingho","westinghou","westinghous","westinghouse","westinghouse ","westinghouse a","westinghouse ai","westinghouse air","westinghouse air ","westinghouse air b","westinghouse air br","westinghouse air bra","westinghouse air brak","westinghouse air brake","westinghouse air brake ","westinghouse air brake t","westinghouse air brake te","westinghouse air brake tec","westinghouse air brake tech","westinghouse air brake techn","westinghouse air brake techno","westinghouse air brake technol","westinghouse air brake technolo","westinghouse air brake technolog","westinghouse air brake technologi","westinghouse air brake technologie","westinghouse air brake technologies","westinghouse air brake technologies ","westinghouse air brake technologies c","westinghouse air brake technologies co","westinghouse air brake technologies cor","westinghouse air brake technologies corp","westinghouse air brake technologies corpo","westinghouse air brake technologies corpor","westinghouse air brake technologies corpora","westinghouse air brake technologies corporat","westinghouse air brake technologies corporati","westinghouse air brake technologies corporatio","westinghouse air brake technologies corporation"],"industry":"Railroads","description":"Westinghouse Air Brake Technologies Corporation provides technology-based equipment, systems, and services for the freight rail and passenger transit industries worldwide. It operates through two segments, Freight and Transit. The Freight segment manufactures and services components for new and existing freight cars and locomotives; builds new commuter locomotives; rebuilds freight locomotives; supplies railway electronics, positive train control equipment, signal design, and engineering services; and provides related heat exchange and cooling systems. It serves publicly traded railroads; leasing companies; manufacturers of original equipment, including locomotives and freight cars; and utilities. The Transit segment manufactures and services components for new and existing passenger transit vehicles, such as regional trains, high speed trains, subway cars, light-rail vehicles, and buses; refurbishes subway cars; and provides heating, ventilation, and air conditioning equipment, as well as doors for buses and subways. This segment serves public transit authorities and municipalities, leasing companies, and manufacturers of subway cars and buses. It also provides electronically controlled pneumatic braking products; railway electronics; freight car trucks; draft gears, couplers, and slack adjusters; air compressors and dryers; heat exchangers and cooling products; and track and switch products. In addition, the company offers railway braking equipment and related components; friction products; new switcher locomotives; transit locomotive and car overhaul services; and freight locomotive overhaul, modernizations, and refurbishment services. Further, it provides platform screen doors; pantographs; window assemblies; couplers; accessibility lifts and ramps for buses and subway cars; and traction motors. The company was founded in 1869 and is headquartered in Pittsburgh, Pennsylvania.","name":"Westinghouse Air Brake Technologies Corporation","exchangeShort":"NYSE","website":"https://www.wabteccorp.com","ipoDate":"1995-06-15"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"WAB"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}