{"props":{"pageProps":{"profile":{"description":"Westpac Banking Corporation provides various banking and financial services in Australia, New Zealand, the Americas, Asia, Europe, and internationally. It offers everyday banking, savings, term deposit, business transaction, foreign currency, and specialized accounts; home, personal, and business loans; credit cards; international and travel services; share trading services; investment; and home, car, travel, life, and business insurance products. The company also provides merchant and payment, corporate and institutional, transaction banking, financial market, corporate and structured finance, trade and supply chain financing, and industry specific banking and treasury services, as well as online banking services. It serves individuals; micro, small, and medium enterprises; commercial business and private wealth clients; and commercial, corporate, institutional, and government customers. The company was formerly known as Bank of New South Wales and changed its name to Westpac Banking Corporation in October 1982. The company was founded in 1817 and is based in Sydney, Australia.","website":"https://www.westpac.com.au","name":"Westpac Banking Corporation","sector":"Financial Services","industry":"Banks—Diversified","symbol":"WBK","exchangeShort":"NYSE","search":["w","wb","wbk","we","wes","west","westp","westpa","westpac","westpac ","westpac b","westpac ba","westpac ban","westpac bank","westpac banki","westpac bankin","westpac banking","westpac banking ","westpac banking c","westpac banking co","westpac banking cor","westpac banking corp","westpac banking corpo","westpac banking corpor","westpac banking corpora","westpac banking corporat","westpac banking corporati","westpac banking corporatio","westpac banking corporation"],"currency":"USD","isStatic":true,"ipoDate":"2013-02-11"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"WBK"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}