{"props":{"pageProps":{"profile":{"isStatic":true,"industry":"Software—Application","sector":"Technology","ipoDate":"2014-05-15","search":["z","ze","zen","zend","zende","zendes","zendesk","zendesk,","zendesk, ","zendesk, i","zendesk, in","zendesk, inc","zendesk, inc."],"currency":"USD","name":"Zendesk, Inc.","exchangeShort":"NYSE","description":"Zendesk, Inc., a software development company, provides software as a service solutions for organizations in the United States, Europe, the Middle East, Africa, the Asia Pacific, and internationally. Its flagship product is Zendesk Support, a system for tracking, prioritizing, and solving customer support tickets across various channels. The company also offers Zendesk Chat, a live chat and messaging software to connect with customers on websites and mobile devices applications; Zendesk Talk, a cloud-based call center software; Zendesk Guide, a knowledge base that powers customer self-service and support agent productivity; Zendesk Gather, a community forum software that allows customer end-users to connect and collaborate; Zendesk Explore, which provides analytics for organizations to measure and enhance the customer experience; and Zendesk Sell, a sales customer relationship management (CRM) product solution to enhance productivity, processes, and pipeline visibility. In addition, it provides Zendesk Sunshine, a CRM platform; Sunshine Conversations, a messaging platform solution; Zendesk Developer Tools, a combination of application programming interfaces, web widget, and mobile software development kits; Zendesk APIs that allow users to build custom integrations and interact with Zendesk data; and Zendesk Apps that enable organizations to customize Zendesk product and platform solution interfaces and optimize workflow through plug-ins, as well as Zendesk Suite, an omnichannel offering, which combines its solutions. The company was founded in 2007 and is headquartered in San Francisco, California.","symbol":"ZEN","website":"https://www.zendesk.com"}},"__N_SSG":true},"page":"/quote/[symbol]","query":{"symbol":"ZEN"},"buildId":"Njk4sJo_1dBWR55wHuASm","isFallback":false,"gsp":true,"scriptLoader":[]}